GopalSaraf/Practicals/PSDL/include/proc/pic18f27q10.inc
// Register: CLC1GLS0
#define CLC1GLS0 CLC1GLS0
CLC1GLS0                                 equ 0E2Dh
// bitfield definitions
CLC1GLS0_G1D1N_POSN                      equ 0000h
CLC1GLS0_G1D1N_POSITION                  equ 0000h
CLC1GLS0_G1D1N_SIZE                      equ 0001h
CLC1GLS0_G1D1N_LENGTH                    equ 0001h
CLC1GLS0_G1D1N_MASK                      equ 0001h
CLC1GLS0_G1D1T_POSN                      equ 0001h
CLC1GLS0_G1D1T_POSITION                  equ 0001h
CLC1GLS0_G1D1T_SIZE                      equ 0001h
CLC1GLS0_G1D1T_LENGTH                    equ 0001h
CLC1GLS0_G1D1T_MASK                      equ 0002h
CLC1GLS0_G1D2N_POSN                      equ 0002h
CLC1GLS0_G1D2N_POSITION                  equ 0002h
CLC1GLS0_G1D2N_SIZE                      equ 0001h
CLC1GLS0_G1D2N_LENGTH                    equ 0001h
CLC1GLS0_G1D2N_MASK                      equ 0004h
CLC1GLS0_G1D2T_POSN                      equ 0003h
CLC1GLS0_G1D2T_POSITION                  equ 0003h
CLC1GLS0_G1D2T_SIZE                      equ 0001h
CLC1GLS0_G1D2T_LENGTH                    equ 0001h
CLC1GLS0_G1D2T_MASK                      equ 0008h
CLC1GLS0_G1D3N_POSN                      equ 0004h
CLC1GLS0_G1D3N_POSITION                  equ 0004h
CLC1GLS0_G1D3N_SIZE                      equ 0001h
CLC1GLS0_G1D3N_LENGTH                    equ 0001h
CLC1GLS0_G1D3N_MASK                      equ 0010h
CLC1GLS0_G1D3T_POSN                      equ 0005h
CLC1GLS0_G1D3T_POSITION                  equ 0005h
CLC1GLS0_G1D3T_SIZE                      equ 0001h
CLC1GLS0_G1D3T_LENGTH                    equ 0001h
CLC1GLS0_G1D3T_MASK                      equ 0020h
CLC1GLS0_G1D4N_POSN                      equ 0006h
CLC1GLS0_G1D4N_POSITION                  equ 0006h
CLC1GLS0_G1D4N_SIZE                      equ 0001h
CLC1GLS0_G1D4N_LENGTH                    equ 0001h
CLC1GLS0_G1D4N_MASK                      equ 0040h
CLC1GLS0_G1D4T_POSN                      equ 0007h
CLC1GLS0_G1D4T_POSITION                  equ 0007h
CLC1GLS0_G1D4T_SIZE                      equ 0001h
CLC1GLS0_G1D4T_LENGTH                    equ 0001h
CLC1GLS0_G1D4T_MASK                      equ 0080h
CLC1GLS0_LC1G1D1N_POSN                   equ 0000h
CLC1GLS0_LC1G1D1N_POSITION               equ 0000h
CLC1GLS0_LC1G1D1N_SIZE                   equ 0001h
CLC1GLS0_LC1G1D1N_LENGTH                 equ 0001h
CLC1GLS0_LC1G1D1N_MASK                   equ 0001h
CLC1GLS0_LC1G1D1T_POSN                   equ 0001h
CLC1GLS0_LC1G1D1T_POSITION               equ 0001h
CLC1GLS0_LC1G1D1T_SIZE                   equ 0001h
CLC1GLS0_LC1G1D1T_LENGTH                 equ 0001h
CLC1GLS0_LC1G1D1T_MASK                   equ 0002h
CLC1GLS0_LC1G1D2N_POSN                   equ 0002h
CLC1GLS0_LC1G1D2N_POSITION               equ 0002h
CLC1GLS0_LC1G1D2N_SIZE                   equ 0001h
CLC1GLS0_LC1G1D2N_LENGTH                 equ 0001h
CLC1GLS0_LC1G1D2N_MASK                   equ 0004h
CLC1GLS0_LC1G1D2T_POSN                   equ 0003h
CLC1GLS0_LC1G1D2T_POSITION               equ 0003h
CLC1GLS0_LC1G1D2T_SIZE                   equ 0001h
CLC1GLS0_LC1G1D2T_LENGTH                 equ 0001h
CLC1GLS0_LC1G1D2T_MASK                   equ 0008h
CLC1GLS0_LC1G1D3N_POSN                   equ 0004h
CLC1GLS0_LC1G1D3N_POSITION               equ 0004h
CLC1GLS0_LC1G1D3N_SIZE                   equ 0001h
CLC1GLS0_LC1G1D3N_LENGTH                 equ 0001h
CLC1GLS0_LC1G1D3N_MASK                   equ 0010h
CLC1GLS0_LC1G1D3T_POSN                   equ 0005h
CLC1GLS0_LC1G1D3T_POSITION               equ 0005h
CLC1GLS0_LC1G1D3T_SIZE                   equ 0001h
CLC1GLS0_LC1G1D3T_LENGTH                 equ 0001h
CLC1GLS0_LC1G1D3T_MASK                   equ 0020h
CLC1GLS0_LC1G1D4N_POSN                   equ 0006h
CLC1GLS0_LC1G1D4N_POSITION               equ 0006h
CLC1GLS0_LC1G1D4N_SIZE                   equ 0001h
CLC1GLS0_LC1G1D4N_LENGTH                 equ 0001h
CLC1GLS0_LC1G1D4N_MASK                   equ 0040h
CLC1GLS0_LC1G1D4T_POSN                   equ 0007h
CLC1GLS0_LC1G1D4T_POSITION               equ 0007h
CLC1GLS0_LC1G1D4T_SIZE                   equ 0001h
CLC1GLS0_LC1G1D4T_LENGTH                 equ 0001h
CLC1GLS0_LC1G1D4T_MASK                   equ 0080h

// Register: CLC1GLS1
#define CLC1GLS1 CLC1GLS1
CLC1GLS1                                 equ 0E2Eh
// bitfield definitions
CLC1GLS1_G2D1N_POSN                      equ 0000h
CLC1GLS1_G2D1N_POSITION                  equ 0000h
CLC1GLS1_G2D1N_SIZE                      equ 0001h
CLC1GLS1_G2D1N_LENGTH                    equ 0001h
CLC1GLS1_G2D1N_MASK                      equ 0001h
CLC1GLS1_G2D1T_POSN                      equ 0001h
CLC1GLS1_G2D1T_POSITION                  equ 0001h
CLC1GLS1_G2D1T_SIZE                      equ 0001h
CLC1GLS1_G2D1T_LENGTH                    equ 0001h
CLC1GLS1_G2D1T_MASK                      equ 0002h
CLC1GLS1_G2D2N_POSN                      equ 0002h
CLC1GLS1_G2D2N_POSITION                  equ 0002h
CLC1GLS1_G2D2N_SIZE                      equ 0001h
CLC1GLS1_G2D2N_LENGTH                    equ 0001h
CLC1GLS1_G2D2N_MASK                      equ 0004h
CLC1GLS1_G2D2T_POSN                      equ 0003h
CLC1GLS1_G2D2T_POSITION                  equ 0003h
CLC1GLS1_G2D2T_SIZE                      equ 0001h
CLC1GLS1_G2D2T_LENGTH                    equ 0001h
CLC1GLS1_G2D2T_MASK                      equ 0008h
CLC1GLS1_G2D3N_POSN                      equ 0004h
CLC1GLS1_G2D3N_POSITION                  equ 0004h
CLC1GLS1_G2D3N_SIZE                      equ 0001h
CLC1GLS1_G2D3N_LENGTH                    equ 0001h
CLC1GLS1_G2D3N_MASK                      equ 0010h
CLC1GLS1_G2D3T_POSN                      equ 0005h
CLC1GLS1_G2D3T_POSITION                  equ 0005h
CLC1GLS1_G2D3T_SIZE                      equ 0001h
CLC1GLS1_G2D3T_LENGTH                    equ 0001h
CLC1GLS1_G2D3T_MASK                      equ 0020h
CLC1GLS1_G2D4N_POSN                      equ 0006h
CLC1GLS1_G2D4N_POSITION                  equ 0006h
CLC1GLS1_G2D4N_SIZE                      equ 0001h
CLC1GLS1_G2D4N_LENGTH                    equ 0001h
CLC1GLS1_G2D4N_MASK                      equ 0040h
CLC1GLS1_G2D4T_POSN                      equ 0007h
CLC1GLS1_G2D4T_POSITION                  equ 0007h
CLC1GLS1_G2D4T_SIZE                      equ 0001h
CLC1GLS1_G2D4T_LENGTH                    equ 0001h
CLC1GLS1_G2D4T_MASK                      equ 0080h
CLC1GLS1_LC1G2D1N_POSN                   equ 0000h
CLC1GLS1_LC1G2D1N_POSITION               equ 0000h
CLC1GLS1_LC1G2D1N_SIZE                   equ 0001h
CLC1GLS1_LC1G2D1N_LENGTH                 equ 0001h
CLC1GLS1_LC1G2D1N_MASK                   equ 0001h
CLC1GLS1_LC1G2D1T_POSN                   equ 0001h
CLC1GLS1_LC1G2D1T_POSITION               equ 0001h
CLC1GLS1_LC1G2D1T_SIZE                   equ 0001h
CLC1GLS1_LC1G2D1T_LENGTH                 equ 0001h
CLC1GLS1_LC1G2D1T_MASK                   equ 0002h
CLC1GLS1_LC1G2D2N_POSN                   equ 0002h
CLC1GLS1_LC1G2D2N_POSITION               equ 0002h
CLC1GLS1_LC1G2D2N_SIZE                   equ 0001h
CLC1GLS1_LC1G2D2N_LENGTH                 equ 0001h
CLC1GLS1_LC1G2D2N_MASK                   equ 0004h
CLC1GLS1_LC1G2D2T_POSN                   equ 0003h
CLC1GLS1_LC1G2D2T_POSITION               equ 0003h
CLC1GLS1_LC1G2D2T_SIZE                   equ 0001h
CLC1GLS1_LC1G2D2T_LENGTH                 equ 0001h
CLC1GLS1_LC1G2D2T_MASK                   equ 0008h
CLC1GLS1_LC1G2D3N_POSN                   equ 0004h
CLC1GLS1_LC1G2D3N_POSITION               equ 0004h
CLC1GLS1_LC1G2D3N_SIZE                   equ 0001h
CLC1GLS1_LC1G2D3N_LENGTH                 equ 0001h
CLC1GLS1_LC1G2D3N_MASK                   equ 0010h
CLC1GLS1_LC1G2D3T_POSN                   equ 0005h
CLC1GLS1_LC1G2D3T_POSITION               equ 0005h
CLC1GLS1_LC1G2D3T_SIZE                   equ 0001h
CLC1GLS1_LC1G2D3T_LENGTH                 equ 0001h
CLC1GLS1_LC1G2D3T_MASK                   equ 0020h
CLC1GLS1_LC1G2D4N_POSN                   equ 0006h
CLC1GLS1_LC1G2D4N_POSITION               equ 0006h
CLC1GLS1_LC1G2D4N_SIZE                   equ 0001h
CLC1GLS1_LC1G2D4N_LENGTH                 equ 0001h
CLC1GLS1_LC1G2D4N_MASK                   equ 0040h
CLC1GLS1_LC1G2D4T_POSN                   equ 0007h
CLC1GLS1_LC1G2D4T_POSITION               equ 0007h
CLC1GLS1_LC1G2D4T_SIZE                   equ 0001h
CLC1GLS1_LC1G2D4T_LENGTH                 equ 0001h
CLC1GLS1_LC1G2D4T_MASK                   equ 0080h

