GopalSaraf/Practicals/PSDL/include/proc/pic18f27q10.inc
// Register: CLC6POL
#define CLC6POL CLC6POL
CLC6POL                                  equ 0E5Ah
// bitfield definitions
CLC6POL_G1POL_POSN                       equ 0000h
CLC6POL_G1POL_POSITION                   equ 0000h
CLC6POL_G1POL_SIZE                       equ 0001h
CLC6POL_G1POL_LENGTH                     equ 0001h
CLC6POL_G1POL_MASK                       equ 0001h
CLC6POL_G2POL_POSN                       equ 0001h
CLC6POL_G2POL_POSITION                   equ 0001h
CLC6POL_G2POL_SIZE                       equ 0001h
CLC6POL_G2POL_LENGTH                     equ 0001h
CLC6POL_G2POL_MASK                       equ 0002h
CLC6POL_G3POL_POSN                       equ 0002h
CLC6POL_G3POL_POSITION                   equ 0002h
CLC6POL_G3POL_SIZE                       equ 0001h
CLC6POL_G3POL_LENGTH                     equ 0001h
CLC6POL_G3POL_MASK                       equ 0004h
CLC6POL_G4POL_POSN                       equ 0003h
CLC6POL_G4POL_POSITION                   equ 0003h
CLC6POL_G4POL_SIZE                       equ 0001h
CLC6POL_G4POL_LENGTH                     equ 0001h
CLC6POL_G4POL_MASK                       equ 0008h
CLC6POL_POL_POSN                         equ 0007h
CLC6POL_POL_POSITION                     equ 0007h
CLC6POL_POL_SIZE                         equ 0001h
CLC6POL_POL_LENGTH                       equ 0001h
CLC6POL_POL_MASK                         equ 0080h
CLC6POL_LC6G1POL_POSN                    equ 0000h
CLC6POL_LC6G1POL_POSITION                equ 0000h
CLC6POL_LC6G1POL_SIZE                    equ 0001h
CLC6POL_LC6G1POL_LENGTH                  equ 0001h
CLC6POL_LC6G1POL_MASK                    equ 0001h
CLC6POL_LC6G2POL_POSN                    equ 0001h
CLC6POL_LC6G2POL_POSITION                equ 0001h
CLC6POL_LC6G2POL_SIZE                    equ 0001h
CLC6POL_LC6G2POL_LENGTH                  equ 0001h
CLC6POL_LC6G2POL_MASK                    equ 0002h
CLC6POL_LC6G3POL_POSN                    equ 0002h
CLC6POL_LC6G3POL_POSITION                equ 0002h
CLC6POL_LC6G3POL_SIZE                    equ 0001h
CLC6POL_LC6G3POL_LENGTH                  equ 0001h
CLC6POL_LC6G3POL_MASK                    equ 0004h
CLC6POL_LC6G4POL_POSN                    equ 0003h
CLC6POL_LC6G4POL_POSITION                equ 0003h
CLC6POL_LC6G4POL_SIZE                    equ 0001h
CLC6POL_LC6G4POL_LENGTH                  equ 0001h
CLC6POL_LC6G4POL_MASK                    equ 0008h
CLC6POL_LC6POL_POSN                      equ 0007h
CLC6POL_LC6POL_POSITION                  equ 0007h
CLC6POL_LC6POL_SIZE                      equ 0001h
CLC6POL_LC6POL_LENGTH                    equ 0001h
CLC6POL_LC6POL_MASK                      equ 0080h

// Register: CLC6SEL0
#define CLC6SEL0 CLC6SEL0
CLC6SEL0                                 equ 0E5Bh
// bitfield definitions
CLC6SEL0_D1S_POSN                        equ 0000h
CLC6SEL0_D1S_POSITION                    equ 0000h
CLC6SEL0_D1S_SIZE                        equ 0008h
CLC6SEL0_D1S_LENGTH                      equ 0008h
CLC6SEL0_D1S_MASK                        equ 00FFh
CLC6SEL0_LC6D1S_POSN                     equ 0000h
CLC6SEL0_LC6D1S_POSITION                 equ 0000h
CLC6SEL0_LC6D1S_SIZE                     equ 0008h
CLC6SEL0_LC6D1S_LENGTH                   equ 0008h
CLC6SEL0_LC6D1S_MASK                     equ 00FFh
CLC6SEL0_D1S0_POSN                       equ 0000h
CLC6SEL0_D1S0_POSITION                   equ 0000h
CLC6SEL0_D1S0_SIZE                       equ 0001h
CLC6SEL0_D1S0_LENGTH                     equ 0001h
CLC6SEL0_D1S0_MASK                       equ 0001h
CLC6SEL0_D1S1_POSN                       equ 0001h
CLC6SEL0_D1S1_POSITION                   equ 0001h
CLC6SEL0_D1S1_SIZE                       equ 0001h
CLC6SEL0_D1S1_LENGTH                     equ 0001h
CLC6SEL0_D1S1_MASK                       equ 0002h
CLC6SEL0_D1S2_POSN                       equ 0002h
CLC6SEL0_D1S2_POSITION                   equ 0002h
CLC6SEL0_D1S2_SIZE                       equ 0001h
CLC6SEL0_D1S2_LENGTH                     equ 0001h
CLC6SEL0_D1S2_MASK                       equ 0004h
CLC6SEL0_D1S3_POSN                       equ 0003h
CLC6SEL0_D1S3_POSITION                   equ 0003h
CLC6SEL0_D1S3_SIZE                       equ 0001h
CLC6SEL0_D1S3_LENGTH                     equ 0001h
CLC6SEL0_D1S3_MASK                       equ 0008h
CLC6SEL0_D1S4_POSN                       equ 0004h
CLC6SEL0_D1S4_POSITION                   equ 0004h
CLC6SEL0_D1S4_SIZE                       equ 0001h
CLC6SEL0_D1S4_LENGTH                     equ 0001h
CLC6SEL0_D1S4_MASK                       equ 0010h
CLC6SEL0_D1S5_POSN                       equ 0005h
CLC6SEL0_D1S5_POSITION                   equ 0005h
CLC6SEL0_D1S5_SIZE                       equ 0001h
CLC6SEL0_D1S5_LENGTH                     equ 0001h
CLC6SEL0_D1S5_MASK                       equ 0020h
CLC6SEL0_D1S6_POSN                       equ 0006h
CLC6SEL0_D1S6_POSITION                   equ 0006h
CLC6SEL0_D1S6_SIZE                       equ 0001h
CLC6SEL0_D1S6_LENGTH                     equ 0001h
CLC6SEL0_D1S6_MASK                       equ 0040h
CLC6SEL0_D1S7_POSN                       equ 0007h
CLC6SEL0_D1S7_POSITION                   equ 0007h
CLC6SEL0_D1S7_SIZE                       equ 0001h
CLC6SEL0_D1S7_LENGTH                     equ 0001h
CLC6SEL0_D1S7_MASK                       equ 0080h
CLC6SEL0_LC6D1S0_POSN                    equ 0000h
CLC6SEL0_LC6D1S0_POSITION                equ 0000h
CLC6SEL0_LC6D1S0_SIZE                    equ 0001h
CLC6SEL0_LC6D1S0_LENGTH                  equ 0001h
CLC6SEL0_LC6D1S0_MASK                    equ 0001h
CLC6SEL0_LC6D1S1_POSN                    equ 0001h
CLC6SEL0_LC6D1S1_POSITION                equ 0001h
CLC6SEL0_LC6D1S1_SIZE                    equ 0001h
CLC6SEL0_LC6D1S1_LENGTH                  equ 0001h
CLC6SEL0_LC6D1S1_MASK                    equ 0002h
CLC6SEL0_LC6D1S2_POSN                    equ 0002h
CLC6SEL0_LC6D1S2_POSITION                equ 0002h
CLC6SEL0_LC6D1S2_SIZE                    equ 0001h
CLC6SEL0_LC6D1S2_LENGTH                  equ 0001h
CLC6SEL0_LC6D1S2_MASK                    equ 0004h
CLC6SEL0_LC6D1S3_POSN                    equ 0003h
CLC6SEL0_LC6D1S3_POSITION                equ 0003h
CLC6SEL0_LC6D1S3_SIZE                    equ 0001h
CLC6SEL0_LC6D1S3_LENGTH                  equ 0001h
CLC6SEL0_LC6D1S3_MASK                    equ 0008h
CLC6SEL0_LC6D1S4_POSN                    equ 0004h
CLC6SEL0_LC6D1S4_POSITION                equ 0004h
CLC6SEL0_LC6D1S4_SIZE                    equ 0001h
CLC6SEL0_LC6D1S4_LENGTH                  equ 0001h
CLC6SEL0_LC6D1S4_MASK                    equ 0010h
CLC6SEL0_LC6D1S5_POSN                    equ 0005h
CLC6SEL0_LC6D1S5_POSITION                equ 0005h
CLC6SEL0_LC6D1S5_SIZE                    equ 0001h
CLC6SEL0_LC6D1S5_LENGTH                  equ 0001h
CLC6SEL0_LC6D1S5_MASK                    equ 0020h
CLC6SEL0_LC6D1S6_POSN                    equ 0006h
CLC6SEL0_LC6D1S6_POSITION                equ 0006h
CLC6SEL0_LC6D1S6_SIZE                    equ 0001h
CLC6SEL0_LC6D1S6_LENGTH                  equ 0001h
CLC6SEL0_LC6D1S6_MASK                    equ 0040h
CLC6SEL0_LC6D1S7_POSN                    equ 0007h
CLC6SEL0_LC6D1S7_POSITION                equ 0007h
CLC6SEL0_LC6D1S7_SIZE                    equ 0001h
CLC6SEL0_LC6D1S7_LENGTH                  equ 0001h
CLC6SEL0_LC6D1S7_MASK                    equ 0080h

// Register: CLC6SEL1
#define CLC6SEL1 CLC6SEL1
CLC6SEL1                                 equ 0E5Ch
// bitfield definitions
CLC6SEL1_D2S_POSN                        equ 0000h
CLC6SEL1_D2S_POSITION                    equ 0000h
CLC6SEL1_D2S_SIZE                        equ 0008h
CLC6SEL1_D2S_LENGTH                      equ 0008h
CLC6SEL1_D2S_MASK                        equ 00FFh
CLC6SEL1_LC6D2S_POSN                     equ 0000h
CLC6SEL1_LC6D2S_POSITION                 equ 0000h
CLC6SEL1_LC6D2S_SIZE                     equ 0008h
CLC6SEL1_LC6D2S_LENGTH                   equ 0008h
CLC6SEL1_LC6D2S_MASK                     equ 00FFh
CLC6SEL1_D2S0_POSN                       equ 0000h
CLC6SEL1_D2S0_POSITION                   equ 0000h
CLC6SEL1_D2S0_SIZE                       equ 0001h
CLC6SEL1_D2S0_LENGTH                     equ 0001h
CLC6SEL1_D2S0_MASK                       equ 0001h
CLC6SEL1_D2S1_POSN                       equ 0001h
CLC6SEL1_D2S1_POSITION                   equ 0001h
CLC6SEL1_D2S1_SIZE                       equ 0001h
CLC6SEL1_D2S1_LENGTH                     equ 0001h
CLC6SEL1_D2S1_MASK                       equ 0002h
CLC6SEL1_D2S2_POSN                       equ 0002h
CLC6SEL1_D2S2_POSITION                   equ 0002h
CLC6SEL1_D2S2_SIZE                       equ 0001h
CLC6SEL1_D2S2_LENGTH                     equ 0001h
CLC6SEL1_D2S2_MASK                       equ 0004h
CLC6SEL1_D2S3_POSN                       equ 0003h
CLC6SEL1_D2S3_POSITION                   equ 0003h
CLC6SEL1_D2S3_SIZE                       equ 0001h
CLC6SEL1_D2S3_LENGTH                     equ 0001h
CLC6SEL1_D2S3_MASK                       equ 0008h
CLC6SEL1_D2S4_POSN                       equ 0004h
CLC6SEL1_D2S4_POSITION                   equ 0004h
CLC6SEL1_D2S4_SIZE                       equ 0001h
CLC6SEL1_D2S4_LENGTH                     equ 0001h
CLC6SEL1_D2S4_MASK                       equ 0010h
CLC6SEL1_D2S5_POSN                       equ 0005h
CLC6SEL1_D2S5_POSITION                   equ 0005h
CLC6SEL1_D2S5_SIZE                       equ 0001h
CLC6SEL1_D2S5_LENGTH                     equ 0001h
CLC6SEL1_D2S5_MASK                       equ 0020h
CLC6SEL1_D2S6_POSN                       equ 0006h
CLC6SEL1_D2S6_POSITION                   equ 0006h
CLC6SEL1_D2S6_SIZE                       equ 0001h
CLC6SEL1_D2S6_LENGTH                     equ 0001h
CLC6SEL1_D2S6_MASK                       equ 0040h
CLC6SEL1_D2S7_POSN                       equ 0007h
CLC6SEL1_D2S7_POSITION                   equ 0007h
CLC6SEL1_D2S7_SIZE                       equ 0001h
CLC6SEL1_D2S7_LENGTH                     equ 0001h
CLC6SEL1_D2S7_MASK                       equ 0080h
CLC6SEL1_LC6D2S0_POSN                    equ 0000h
CLC6SEL1_LC6D2S0_POSITION                equ 0000h
CLC6SEL1_LC6D2S0_SIZE                    equ 0001h
CLC6SEL1_LC6D2S0_LENGTH                  equ 0001h
CLC6SEL1_LC6D2S0_MASK                    equ 0001h
CLC6SEL1_LC6D2S1_POSN                    equ 0001h
CLC6SEL1_LC6D2S1_POSITION                equ 0001h
CLC6SEL1_LC6D2S1_SIZE                    equ 0001h
CLC6SEL1_LC6D2S1_LENGTH                  equ 0001h
CLC6SEL1_LC6D2S1_MASK                    equ 0002h
CLC6SEL1_LC6D2S2_POSN                    equ 0002h
CLC6SEL1_LC6D2S2_POSITION                equ 0002h
CLC6SEL1_LC6D2S2_SIZE                    equ 0001h
CLC6SEL1_LC6D2S2_LENGTH                  equ 0001h
CLC6SEL1_LC6D2S2_MASK                    equ 0004h
CLC6SEL1_LC6D2S3_POSN                    equ 0003h
CLC6SEL1_LC6D2S3_POSITION                equ 0003h
CLC6SEL1_LC6D2S3_SIZE                    equ 0001h
CLC6SEL1_LC6D2S3_LENGTH                  equ 0001h
CLC6SEL1_LC6D2S3_MASK                    equ 0008h
CLC6SEL1_LC6D2S4_POSN                    equ 0004h
CLC6SEL1_LC6D2S4_POSITION                equ 0004h
CLC6SEL1_LC6D2S4_SIZE                    equ 0001h
CLC6SEL1_LC6D2S4_LENGTH                  equ 0001h
CLC6SEL1_LC6D2S4_MASK                    equ 0010h
CLC6SEL1_LC6D2S5_POSN                    equ 0005h
CLC6SEL1_LC6D2S5_POSITION                equ 0005h
CLC6SEL1_LC6D2S5_SIZE                    equ 0001h
CLC6SEL1_LC6D2S5_LENGTH                  equ 0001h
CLC6SEL1_LC6D2S5_MASK                    equ 0020h
CLC6SEL1_LC6D2S6_POSN                    equ 0006h
CLC6SEL1_LC6D2S6_POSITION                equ 0006h
CLC6SEL1_LC6D2S6_SIZE                    equ 0001h
CLC6SEL1_LC6D2S6_LENGTH                  equ 0001h
CLC6SEL1_LC6D2S6_MASK                    equ 0040h
CLC6SEL1_LC6D2S7_POSN                    equ 0007h
CLC6SEL1_LC6D2S7_POSITION                equ 0007h
CLC6SEL1_LC6D2S7_SIZE                    equ 0001h
CLC6SEL1_LC6D2S7_LENGTH                  equ 0001h
CLC6SEL1_LC6D2S7_MASK                    equ 0080h

// Register: CLC6SEL2
#define CLC6SEL2 CLC6SEL2
CLC6SEL2                                 equ 0E5Dh
// bitfield definitions
CLC6SEL2_D3S_POSN                        equ 0000h
CLC6SEL2_D3S_POSITION                    equ 0000h
CLC6SEL2_D3S_SIZE                        equ 0008h
CLC6SEL2_D3S_LENGTH                      equ 0008h
CLC6SEL2_D3S_MASK                        equ 00FFh
CLC6SEL2_LC6D3S_POSN                     equ 0000h
CLC6SEL2_LC6D3S_POSITION                 equ 0000h
CLC6SEL2_LC6D3S_SIZE                     equ 0008h
CLC6SEL2_LC6D3S_LENGTH                   equ 0008h
CLC6SEL2_LC6D3S_MASK                     equ 00FFh
CLC6SEL2_D3S0_POSN                       equ 0000h
CLC6SEL2_D3S0_POSITION                   equ 0000h
CLC6SEL2_D3S0_SIZE                       equ 0001h
CLC6SEL2_D3S0_LENGTH                     equ 0001h
CLC6SEL2_D3S0_MASK                       equ 0001h
CLC6SEL2_D3S1_POSN                       equ 0001h
CLC6SEL2_D3S1_POSITION                   equ 0001h
CLC6SEL2_D3S1_SIZE                       equ 0001h
CLC6SEL2_D3S1_LENGTH                     equ 0001h
CLC6SEL2_D3S1_MASK                       equ 0002h
CLC6SEL2_D3S2_POSN                       equ 0002h
CLC6SEL2_D3S2_POSITION                   equ 0002h
CLC6SEL2_D3S2_SIZE                       equ 0001h
CLC6SEL2_D3S2_LENGTH                     equ 0001h
CLC6SEL2_D3S2_MASK                       equ 0004h
CLC6SEL2_D3S3_POSN                       equ 0003h
CLC6SEL2_D3S3_POSITION                   equ 0003h
CLC6SEL2_D3S3_SIZE                       equ 0001h
CLC6SEL2_D3S3_LENGTH                     equ 0001h
CLC6SEL2_D3S3_MASK                       equ 0008h
CLC6SEL2_D3S4_POSN                       equ 0004h
CLC6SEL2_D3S4_POSITION                   equ 0004h
CLC6SEL2_D3S4_SIZE                       equ 0001h
CLC6SEL2_D3S4_LENGTH                     equ 0001h
CLC6SEL2_D3S4_MASK                       equ 0010h
CLC6SEL2_D3S5_POSN                       equ 0005h
CLC6SEL2_D3S5_POSITION                   equ 0005h
CLC6SEL2_D3S5_SIZE                       equ 0001h
CLC6SEL2_D3S5_LENGTH                     equ 0001h
CLC6SEL2_D3S5_MASK                       equ 0020h
CLC6SEL2_D3S6_POSN                       equ 0006h
CLC6SEL2_D3S6_POSITION                   equ 0006h
CLC6SEL2_D3S6_SIZE                       equ 0001h
CLC6SEL2_D3S6_LENGTH                     equ 0001h
CLC6SEL2_D3S6_MASK                       equ 0040h
CLC6SEL2_D3S7_POSN                       equ 0007h
CLC6SEL2_D3S7_POSITION                   equ 0007h
CLC6SEL2_D3S7_SIZE                       equ 0001h
CLC6SEL2_D3S7_LENGTH                     equ 0001h
CLC6SEL2_D3S7_MASK                       equ 0080h
CLC6SEL2_LC6D3S0_POSN                    equ 0000h
CLC6SEL2_LC6D3S0_POSITION                equ 0000h
CLC6SEL2_LC6D3S0_SIZE                    equ 0001h
CLC6SEL2_LC6D3S0_LENGTH                  equ 0001h
CLC6SEL2_LC6D3S0_MASK                    equ 0001h
CLC6SEL2_LC6D3S1_POSN                    equ 0001h
CLC6SEL2_LC6D3S1_POSITION                equ 0001h
CLC6SEL2_LC6D3S1_SIZE                    equ 0001h
CLC6SEL2_LC6D3S1_LENGTH                  equ 0001h
CLC6SEL2_LC6D3S1_MASK                    equ 0002h
CLC6SEL2_LC6D3S2_POSN                    equ 0002h
CLC6SEL2_LC6D3S2_POSITION                equ 0002h
CLC6SEL2_LC6D3S2_SIZE                    equ 0001h
CLC6SEL2_LC6D3S2_LENGTH                  equ 0001h
CLC6SEL2_LC6D3S2_MASK                    equ 0004h
CLC6SEL2_LC6D3S3_POSN                    equ 0003h
CLC6SEL2_LC6D3S3_POSITION                equ 0003h
CLC6SEL2_LC6D3S3_SIZE                    equ 0001h
CLC6SEL2_LC6D3S3_LENGTH                  equ 0001h
CLC6SEL2_LC6D3S3_MASK                    equ 0008h
CLC6SEL2_LC6D3S4_POSN                    equ 0004h
CLC6SEL2_LC6D3S4_POSITION                equ 0004h
CLC6SEL2_LC6D3S4_SIZE                    equ 0001h
CLC6SEL2_LC6D3S4_LENGTH                  equ 0001h
CLC6SEL2_LC6D3S4_MASK                    equ 0010h
CLC6SEL2_LC6D3S5_POSN                    equ 0005h
CLC6SEL2_LC6D3S5_POSITION                equ 0005h
CLC6SEL2_LC6D3S5_SIZE                    equ 0001h
CLC6SEL2_LC6D3S5_LENGTH                  equ 0001h
CLC6SEL2_LC6D3S5_MASK                    equ 0020h
CLC6SEL2_LC6D3S6_POSN                    equ 0006h
CLC6SEL2_LC6D3S6_POSITION                equ 0006h
CLC6SEL2_LC6D3S6_SIZE                    equ 0001h
CLC6SEL2_LC6D3S6_LENGTH                  equ 0001h
CLC6SEL2_LC6D3S6_MASK                    equ 0040h
CLC6SEL2_LC6D3S7_POSN                    equ 0007h
CLC6SEL2_LC6D3S7_POSITION                equ 0007h
CLC6SEL2_LC6D3S7_SIZE                    equ 0001h
CLC6SEL2_LC6D3S7_LENGTH                  equ 0001h
CLC6SEL2_LC6D3S7_MASK                    equ 0080h

// Register: CLC6SEL3
#define CLC6SEL3 CLC6SEL3
CLC6SEL3                                 equ 0E5Eh
// bitfield definitions
CLC6SEL3_D4S_POSN                        equ 0000h
CLC6SEL3_D4S_POSITION                    equ 0000h
CLC6SEL3_D4S_SIZE                        equ 0008h
CLC6SEL3_D4S_LENGTH                      equ 0008h
CLC6SEL3_D4S_MASK                        equ 00FFh
CLC6SEL3_LC6D4S_POSN                     equ 0000h
CLC6SEL3_LC6D4S_POSITION                 equ 0000h
CLC6SEL3_LC6D4S_SIZE                     equ 0008h
CLC6SEL3_LC6D4S_LENGTH                   equ 0008h
CLC6SEL3_LC6D4S_MASK                     equ 00FFh
CLC6SEL3_D4S0_POSN                       equ 0000h
CLC6SEL3_D4S0_POSITION                   equ 0000h
CLC6SEL3_D4S0_SIZE                       equ 0001h
CLC6SEL3_D4S0_LENGTH                     equ 0001h
CLC6SEL3_D4S0_MASK                       equ 0001h
CLC6SEL3_D4S1_POSN                       equ 0001h
CLC6SEL3_D4S1_POSITION                   equ 0001h
CLC6SEL3_D4S1_SIZE                       equ 0001h
CLC6SEL3_D4S1_LENGTH                     equ 0001h
CLC6SEL3_D4S1_MASK                       equ 0002h
CLC6SEL3_D4S2_POSN                       equ 0002h
CLC6SEL3_D4S2_POSITION                   equ 0002h
CLC6SEL3_D4S2_SIZE                       equ 0001h
CLC6SEL3_D4S2_LENGTH                     equ 0001h
CLC6SEL3_D4S2_MASK                       equ 0004h
CLC6SEL3_D4S3_POSN                       equ 0003h
CLC6SEL3_D4S3_POSITION                   equ 0003h
CLC6SEL3_D4S3_SIZE                       equ 0001h
CLC6SEL3_D4S3_LENGTH                     equ 0001h
CLC6SEL3_D4S3_MASK                       equ 0008h
CLC6SEL3_D4S4_POSN                       equ 0004h
CLC6SEL3_D4S4_POSITION                   equ 0004h
CLC6SEL3_D4S4_SIZE                       equ 0001h
CLC6SEL3_D4S4_LENGTH                     equ 0001h
CLC6SEL3_D4S4_MASK                       equ 0010h
CLC6SEL3_D4S5_POSN                       equ 0005h
CLC6SEL3_D4S5_POSITION                   equ 0005h
CLC6SEL3_D4S5_SIZE                       equ 0001h
CLC6SEL3_D4S5_LENGTH                     equ 0001h
CLC6SEL3_D4S5_MASK                       equ 0020h
CLC6SEL3_D4S6_POSN                       equ 0006h
CLC6SEL3_D4S6_POSITION                   equ 0006h
CLC6SEL3_D4S6_SIZE                       equ 0001h
CLC6SEL3_D4S6_LENGTH                     equ 0001h
CLC6SEL3_D4S6_MASK                       equ 0040h
CLC6SEL3_D4S7_POSN                       equ 0007h
CLC6SEL3_D4S7_POSITION                   equ 0007h
CLC6SEL3_D4S7_SIZE                       equ 0001h
CLC6SEL3_D4S7_LENGTH                     equ 0001h
CLC6SEL3_D4S7_MASK                       equ 0080h
CLC6SEL3_LC6D4S0_POSN                    equ 0000h
CLC6SEL3_LC6D4S0_POSITION                equ 0000h
CLC6SEL3_LC6D4S0_SIZE                    equ 0001h
CLC6SEL3_LC6D4S0_LENGTH                  equ 0001h
CLC6SEL3_LC6D4S0_MASK                    equ 0001h
CLC6SEL3_LC6D4S1_POSN                    equ 0001h
CLC6SEL3_LC6D4S1_POSITION                equ 0001h
CLC6SEL3_LC6D4S1_SIZE                    equ 0001h
CLC6SEL3_LC6D4S1_LENGTH                  equ 0001h
CLC6SEL3_LC6D4S1_MASK                    equ 0002h
CLC6SEL3_LC6D4S2_POSN                    equ 0002h
CLC6SEL3_LC6D4S2_POSITION                equ 0002h
CLC6SEL3_LC6D4S2_SIZE                    equ 0001h
CLC6SEL3_LC6D4S2_LENGTH                  equ 0001h
CLC6SEL3_LC6D4S2_MASK                    equ 0004h
CLC6SEL3_LC6D4S3_POSN                    equ 0003h
CLC6SEL3_LC6D4S3_POSITION                equ 0003h
CLC6SEL3_LC6D4S3_SIZE                    equ 0001h
CLC6SEL3_LC6D4S3_LENGTH                  equ 0001h
CLC6SEL3_LC6D4S3_MASK                    equ 0008h
CLC6SEL3_LC6D4S4_POSN                    equ 0004h
CLC6SEL3_LC6D4S4_POSITION                equ 0004h
CLC6SEL3_LC6D4S4_SIZE                    equ 0001h
CLC6SEL3_LC6D4S4_LENGTH                  equ 0001h
CLC6SEL3_LC6D4S4_MASK                    equ 0010h
CLC6SEL3_LC6D4S5_POSN                    equ 0005h
CLC6SEL3_LC6D4S5_POSITION                equ 0005h
CLC6SEL3_LC6D4S5_SIZE                    equ 0001h
CLC6SEL3_LC6D4S5_LENGTH                  equ 0001h
CLC6SEL3_LC6D4S5_MASK                    equ 0020h
CLC6SEL3_LC6D4S6_POSN                    equ 0006h
CLC6SEL3_LC6D4S6_POSITION                equ 0006h
CLC6SEL3_LC6D4S6_SIZE                    equ 0001h
CLC6SEL3_LC6D4S6_LENGTH                  equ 0001h
CLC6SEL3_LC6D4S6_MASK                    equ 0040h
CLC6SEL3_LC6D4S7_POSN                    equ 0007h
CLC6SEL3_LC6D4S7_POSITION                equ 0007h
CLC6SEL3_LC6D4S7_SIZE                    equ 0001h
CLC6SEL3_LC6D4S7_LENGTH                  equ 0001h
CLC6SEL3_LC6D4S7_MASK                    equ 0080h

