GopalSaraf/Practicals/PSDL/include/proc/pic18f27q10.inc
// Register: CLC7SEL3
#define CLC7SEL3 CLC7SEL3
CLC7SEL3                                 equ 0E68h
// bitfield definitions
CLC7SEL3_D4S_POSN                        equ 0000h
CLC7SEL3_D4S_POSITION                    equ 0000h
CLC7SEL3_D4S_SIZE                        equ 0008h
CLC7SEL3_D4S_LENGTH                      equ 0008h
CLC7SEL3_D4S_MASK                        equ 00FFh
CLC7SEL3_LC7D4S_POSN                     equ 0000h
CLC7SEL3_LC7D4S_POSITION                 equ 0000h
CLC7SEL3_LC7D4S_SIZE                     equ 0008h
CLC7SEL3_LC7D4S_LENGTH                   equ 0008h
CLC7SEL3_LC7D4S_MASK                     equ 00FFh
CLC7SEL3_D4S0_POSN                       equ 0000h
CLC7SEL3_D4S0_POSITION                   equ 0000h
CLC7SEL3_D4S0_SIZE                       equ 0001h
CLC7SEL3_D4S0_LENGTH                     equ 0001h
CLC7SEL3_D4S0_MASK                       equ 0001h
CLC7SEL3_D4S1_POSN                       equ 0001h
CLC7SEL3_D4S1_POSITION                   equ 0001h
CLC7SEL3_D4S1_SIZE                       equ 0001h
CLC7SEL3_D4S1_LENGTH                     equ 0001h
CLC7SEL3_D4S1_MASK                       equ 0002h
CLC7SEL3_D4S2_POSN                       equ 0002h
CLC7SEL3_D4S2_POSITION                   equ 0002h
CLC7SEL3_D4S2_SIZE                       equ 0001h
CLC7SEL3_D4S2_LENGTH                     equ 0001h
CLC7SEL3_D4S2_MASK                       equ 0004h
CLC7SEL3_D4S3_POSN                       equ 0003h
CLC7SEL3_D4S3_POSITION                   equ 0003h
CLC7SEL3_D4S3_SIZE                       equ 0001h
CLC7SEL3_D4S3_LENGTH                     equ 0001h
CLC7SEL3_D4S3_MASK                       equ 0008h
CLC7SEL3_D4S4_POSN                       equ 0004h
CLC7SEL3_D4S4_POSITION                   equ 0004h
CLC7SEL3_D4S4_SIZE                       equ 0001h
CLC7SEL3_D4S4_LENGTH                     equ 0001h
CLC7SEL3_D4S4_MASK                       equ 0010h
CLC7SEL3_D4S5_POSN                       equ 0005h
CLC7SEL3_D4S5_POSITION                   equ 0005h
CLC7SEL3_D4S5_SIZE                       equ 0001h
CLC7SEL3_D4S5_LENGTH                     equ 0001h
CLC7SEL3_D4S5_MASK                       equ 0020h
CLC7SEL3_D4S6_POSN                       equ 0006h
CLC7SEL3_D4S6_POSITION                   equ 0006h
CLC7SEL3_D4S6_SIZE                       equ 0001h
CLC7SEL3_D4S6_LENGTH                     equ 0001h
CLC7SEL3_D4S6_MASK                       equ 0040h
CLC7SEL3_D4S7_POSN                       equ 0007h
CLC7SEL3_D4S7_POSITION                   equ 0007h
CLC7SEL3_D4S7_SIZE                       equ 0001h
CLC7SEL3_D4S7_LENGTH                     equ 0001h
CLC7SEL3_D4S7_MASK                       equ 0080h
CLC7SEL3_LC7D4S0_POSN                    equ 0000h
CLC7SEL3_LC7D4S0_POSITION                equ 0000h
CLC7SEL3_LC7D4S0_SIZE                    equ 0001h
CLC7SEL3_LC7D4S0_LENGTH                  equ 0001h
CLC7SEL3_LC7D4S0_MASK                    equ 0001h
CLC7SEL3_LC7D4S1_POSN                    equ 0001h
CLC7SEL3_LC7D4S1_POSITION                equ 0001h
CLC7SEL3_LC7D4S1_SIZE                    equ 0001h
CLC7SEL3_LC7D4S1_LENGTH                  equ 0001h
CLC7SEL3_LC7D4S1_MASK                    equ 0002h
CLC7SEL3_LC7D4S2_POSN                    equ 0002h
CLC7SEL3_LC7D4S2_POSITION                equ 0002h
CLC7SEL3_LC7D4S2_SIZE                    equ 0001h
CLC7SEL3_LC7D4S2_LENGTH                  equ 0001h
CLC7SEL3_LC7D4S2_MASK                    equ 0004h
CLC7SEL3_LC7D4S3_POSN                    equ 0003h
CLC7SEL3_LC7D4S3_POSITION                equ 0003h
CLC7SEL3_LC7D4S3_SIZE                    equ 0001h
CLC7SEL3_LC7D4S3_LENGTH                  equ 0001h
CLC7SEL3_LC7D4S3_MASK                    equ 0008h
CLC7SEL3_LC7D4S4_POSN                    equ 0004h
CLC7SEL3_LC7D4S4_POSITION                equ 0004h
CLC7SEL3_LC7D4S4_SIZE                    equ 0001h
CLC7SEL3_LC7D4S4_LENGTH                  equ 0001h
CLC7SEL3_LC7D4S4_MASK                    equ 0010h
CLC7SEL3_LC7D4S5_POSN                    equ 0005h
CLC7SEL3_LC7D4S5_POSITION                equ 0005h
CLC7SEL3_LC7D4S5_SIZE                    equ 0001h
CLC7SEL3_LC7D4S5_LENGTH                  equ 0001h
CLC7SEL3_LC7D4S5_MASK                    equ 0020h
CLC7SEL3_LC7D4S6_POSN                    equ 0006h
CLC7SEL3_LC7D4S6_POSITION                equ 0006h
CLC7SEL3_LC7D4S6_SIZE                    equ 0001h
CLC7SEL3_LC7D4S6_LENGTH                  equ 0001h
CLC7SEL3_LC7D4S6_MASK                    equ 0040h
CLC7SEL3_LC7D4S7_POSN                    equ 0007h
CLC7SEL3_LC7D4S7_POSITION                equ 0007h
CLC7SEL3_LC7D4S7_SIZE                    equ 0001h
CLC7SEL3_LC7D4S7_LENGTH                  equ 0001h
CLC7SEL3_LC7D4S7_MASK                    equ 0080h

// Register: CLC7GLS0
#define CLC7GLS0 CLC7GLS0
CLC7GLS0                                 equ 0E69h
// bitfield definitions
CLC7GLS0_G1D1N_POSN                      equ 0000h
CLC7GLS0_G1D1N_POSITION                  equ 0000h
CLC7GLS0_G1D1N_SIZE                      equ 0001h
CLC7GLS0_G1D1N_LENGTH                    equ 0001h
CLC7GLS0_G1D1N_MASK                      equ 0001h
CLC7GLS0_G1D1T_POSN                      equ 0001h
CLC7GLS0_G1D1T_POSITION                  equ 0001h
CLC7GLS0_G1D1T_SIZE                      equ 0001h
CLC7GLS0_G1D1T_LENGTH                    equ 0001h
CLC7GLS0_G1D1T_MASK                      equ 0002h
CLC7GLS0_G1D2N_POSN                      equ 0002h
CLC7GLS0_G1D2N_POSITION                  equ 0002h
CLC7GLS0_G1D2N_SIZE                      equ 0001h
CLC7GLS0_G1D2N_LENGTH                    equ 0001h
CLC7GLS0_G1D2N_MASK                      equ 0004h
CLC7GLS0_G1D2T_POSN                      equ 0003h
CLC7GLS0_G1D2T_POSITION                  equ 0003h
CLC7GLS0_G1D2T_SIZE                      equ 0001h
CLC7GLS0_G1D2T_LENGTH                    equ 0001h
CLC7GLS0_G1D2T_MASK                      equ 0008h
CLC7GLS0_G1D3N_POSN                      equ 0004h
CLC7GLS0_G1D3N_POSITION                  equ 0004h
CLC7GLS0_G1D3N_SIZE                      equ 0001h
CLC7GLS0_G1D3N_LENGTH                    equ 0001h
CLC7GLS0_G1D3N_MASK                      equ 0010h
CLC7GLS0_G1D3T_POSN                      equ 0005h
CLC7GLS0_G1D3T_POSITION                  equ 0005h
CLC7GLS0_G1D3T_SIZE                      equ 0001h
CLC7GLS0_G1D3T_LENGTH                    equ 0001h
CLC7GLS0_G1D3T_MASK                      equ 0020h
CLC7GLS0_G1D4N_POSN                      equ 0006h
CLC7GLS0_G1D4N_POSITION                  equ 0006h
CLC7GLS0_G1D4N_SIZE                      equ 0001h
CLC7GLS0_G1D4N_LENGTH                    equ 0001h
CLC7GLS0_G1D4N_MASK                      equ 0040h
CLC7GLS0_G1D4T_POSN                      equ 0007h
CLC7GLS0_G1D4T_POSITION                  equ 0007h
CLC7GLS0_G1D4T_SIZE                      equ 0001h
CLC7GLS0_G1D4T_LENGTH                    equ 0001h
CLC7GLS0_G1D4T_MASK                      equ 0080h
CLC7GLS0_LC7G1D1N_POSN                   equ 0000h
CLC7GLS0_LC7G1D1N_POSITION               equ 0000h
CLC7GLS0_LC7G1D1N_SIZE                   equ 0001h
CLC7GLS0_LC7G1D1N_LENGTH                 equ 0001h
CLC7GLS0_LC7G1D1N_MASK                   equ 0001h
CLC7GLS0_LC7G1D1T_POSN                   equ 0001h
CLC7GLS0_LC7G1D1T_POSITION               equ 0001h
CLC7GLS0_LC7G1D1T_SIZE                   equ 0001h
CLC7GLS0_LC7G1D1T_LENGTH                 equ 0001h
CLC7GLS0_LC7G1D1T_MASK                   equ 0002h
CLC7GLS0_LC7G1D2N_POSN                   equ 0002h
CLC7GLS0_LC7G1D2N_POSITION               equ 0002h
CLC7GLS0_LC7G1D2N_SIZE                   equ 0001h
CLC7GLS0_LC7G1D2N_LENGTH                 equ 0001h
CLC7GLS0_LC7G1D2N_MASK                   equ 0004h
CLC7GLS0_LC7G1D2T_POSN                   equ 0003h
CLC7GLS0_LC7G1D2T_POSITION               equ 0003h
CLC7GLS0_LC7G1D2T_SIZE                   equ 0001h
CLC7GLS0_LC7G1D2T_LENGTH                 equ 0001h
CLC7GLS0_LC7G1D2T_MASK                   equ 0008h
CLC7GLS0_LC7G1D3N_POSN                   equ 0004h
CLC7GLS0_LC7G1D3N_POSITION               equ 0004h
CLC7GLS0_LC7G1D3N_SIZE                   equ 0001h
CLC7GLS0_LC7G1D3N_LENGTH                 equ 0001h
CLC7GLS0_LC7G1D3N_MASK                   equ 0010h
CLC7GLS0_LC7G1D3T_POSN                   equ 0005h
CLC7GLS0_LC7G1D3T_POSITION               equ 0005h
CLC7GLS0_LC7G1D3T_SIZE                   equ 0001h
CLC7GLS0_LC7G1D3T_LENGTH                 equ 0001h
CLC7GLS0_LC7G1D3T_MASK                   equ 0020h
CLC7GLS0_LC7G1D4N_POSN                   equ 0006h
CLC7GLS0_LC7G1D4N_POSITION               equ 0006h
CLC7GLS0_LC7G1D4N_SIZE                   equ 0001h
CLC7GLS0_LC7G1D4N_LENGTH                 equ 0001h
CLC7GLS0_LC7G1D4N_MASK                   equ 0040h
CLC7GLS0_LC7G1D4T_POSN                   equ 0007h
CLC7GLS0_LC7G1D4T_POSITION               equ 0007h
CLC7GLS0_LC7G1D4T_SIZE                   equ 0001h
CLC7GLS0_LC7G1D4T_LENGTH                 equ 0001h
CLC7GLS0_LC7G1D4T_MASK                   equ 0080h

// Register: CLC7GLS1
#define CLC7GLS1 CLC7GLS1
CLC7GLS1                                 equ 0E6Ah
// bitfield definitions
CLC7GLS1_G2D1N_POSN                      equ 0000h
CLC7GLS1_G2D1N_POSITION                  equ 0000h
CLC7GLS1_G2D1N_SIZE                      equ 0001h
CLC7GLS1_G2D1N_LENGTH                    equ 0001h
CLC7GLS1_G2D1N_MASK                      equ 0001h
CLC7GLS1_G2D1T_POSN                      equ 0001h
CLC7GLS1_G2D1T_POSITION                  equ 0001h
CLC7GLS1_G2D1T_SIZE                      equ 0001h
CLC7GLS1_G2D1T_LENGTH                    equ 0001h
CLC7GLS1_G2D1T_MASK                      equ 0002h
CLC7GLS1_G2D2N_POSN                      equ 0002h
CLC7GLS1_G2D2N_POSITION                  equ 0002h
CLC7GLS1_G2D2N_SIZE                      equ 0001h
CLC7GLS1_G2D2N_LENGTH                    equ 0001h
CLC7GLS1_G2D2N_MASK                      equ 0004h
CLC7GLS1_G2D2T_POSN                      equ 0003h
CLC7GLS1_G2D2T_POSITION                  equ 0003h
CLC7GLS1_G2D2T_SIZE                      equ 0001h
CLC7GLS1_G2D2T_LENGTH                    equ 0001h
CLC7GLS1_G2D2T_MASK                      equ 0008h
CLC7GLS1_G2D3N_POSN                      equ 0004h
CLC7GLS1_G2D3N_POSITION                  equ 0004h
CLC7GLS1_G2D3N_SIZE                      equ 0001h
CLC7GLS1_G2D3N_LENGTH                    equ 0001h
CLC7GLS1_G2D3N_MASK                      equ 0010h
CLC7GLS1_G2D3T_POSN                      equ 0005h
CLC7GLS1_G2D3T_POSITION                  equ 0005h
CLC7GLS1_G2D3T_SIZE                      equ 0001h
CLC7GLS1_G2D3T_LENGTH                    equ 0001h
CLC7GLS1_G2D3T_MASK                      equ 0020h
CLC7GLS1_G2D4N_POSN                      equ 0006h
CLC7GLS1_G2D4N_POSITION                  equ 0006h
CLC7GLS1_G2D4N_SIZE                      equ 0001h
CLC7GLS1_G2D4N_LENGTH                    equ 0001h
CLC7GLS1_G2D4N_MASK                      equ 0040h
CLC7GLS1_G2D4T_POSN                      equ 0007h
CLC7GLS1_G2D4T_POSITION                  equ 0007h
CLC7GLS1_G2D4T_SIZE                      equ 0001h
CLC7GLS1_G2D4T_LENGTH                    equ 0001h
CLC7GLS1_G2D4T_MASK                      equ 0080h
CLC7GLS1_LC7G2D1N_POSN                   equ 0000h
CLC7GLS1_LC7G2D1N_POSITION               equ 0000h
CLC7GLS1_LC7G2D1N_SIZE                   equ 0001h
CLC7GLS1_LC7G2D1N_LENGTH                 equ 0001h
CLC7GLS1_LC7G2D1N_MASK                   equ 0001h
CLC7GLS1_LC7G2D1T_POSN                   equ 0001h
CLC7GLS1_LC7G2D1T_POSITION               equ 0001h
CLC7GLS1_LC7G2D1T_SIZE                   equ 0001h
CLC7GLS1_LC7G2D1T_LENGTH                 equ 0001h
CLC7GLS1_LC7G2D1T_MASK                   equ 0002h
CLC7GLS1_LC7G2D2N_POSN                   equ 0002h
CLC7GLS1_LC7G2D2N_POSITION               equ 0002h
CLC7GLS1_LC7G2D2N_SIZE                   equ 0001h
CLC7GLS1_LC7G2D2N_LENGTH                 equ 0001h
CLC7GLS1_LC7G2D2N_MASK                   equ 0004h
CLC7GLS1_LC7G2D2T_POSN                   equ 0003h
CLC7GLS1_LC7G2D2T_POSITION               equ 0003h
CLC7GLS1_LC7G2D2T_SIZE                   equ 0001h
CLC7GLS1_LC7G2D2T_LENGTH                 equ 0001h
CLC7GLS1_LC7G2D2T_MASK                   equ 0008h
CLC7GLS1_LC7G2D3N_POSN                   equ 0004h
CLC7GLS1_LC7G2D3N_POSITION               equ 0004h
CLC7GLS1_LC7G2D3N_SIZE                   equ 0001h
CLC7GLS1_LC7G2D3N_LENGTH                 equ 0001h
CLC7GLS1_LC7G2D3N_MASK                   equ 0010h
CLC7GLS1_LC7G2D3T_POSN                   equ 0005h
CLC7GLS1_LC7G2D3T_POSITION               equ 0005h
CLC7GLS1_LC7G2D3T_SIZE                   equ 0001h
CLC7GLS1_LC7G2D3T_LENGTH                 equ 0001h
CLC7GLS1_LC7G2D3T_MASK                   equ 0020h
CLC7GLS1_LC7G2D4N_POSN                   equ 0006h
CLC7GLS1_LC7G2D4N_POSITION               equ 0006h
CLC7GLS1_LC7G2D4N_SIZE                   equ 0001h
CLC7GLS1_LC7G2D4N_LENGTH                 equ 0001h
CLC7GLS1_LC7G2D4N_MASK                   equ 0040h
CLC7GLS1_LC7G2D4T_POSN                   equ 0007h
CLC7GLS1_LC7G2D4T_POSITION               equ 0007h
CLC7GLS1_LC7G2D4T_SIZE                   equ 0001h
CLC7GLS1_LC7G2D4T_LENGTH                 equ 0001h
CLC7GLS1_LC7G2D4T_MASK                   equ 0080h

