GopalSaraf/Practicals/PSDL/include/proc/pic18f27q10.inc
// Register: CLC8SEL2
#define CLC8SEL2 CLC8SEL2
CLC8SEL2                                 equ 0E71h
// bitfield definitions
CLC8SEL2_D3S_POSN                        equ 0000h
CLC8SEL2_D3S_POSITION                    equ 0000h
CLC8SEL2_D3S_SIZE                        equ 0008h
CLC8SEL2_D3S_LENGTH                      equ 0008h
CLC8SEL2_D3S_MASK                        equ 00FFh
CLC8SEL2_LC8D3S_POSN                     equ 0000h
CLC8SEL2_LC8D3S_POSITION                 equ 0000h
CLC8SEL2_LC8D3S_SIZE                     equ 0008h
CLC8SEL2_LC8D3S_LENGTH                   equ 0008h
CLC8SEL2_LC8D3S_MASK                     equ 00FFh
CLC8SEL2_D3S0_POSN                       equ 0000h
CLC8SEL2_D3S0_POSITION                   equ 0000h
CLC8SEL2_D3S0_SIZE                       equ 0001h
CLC8SEL2_D3S0_LENGTH                     equ 0001h
CLC8SEL2_D3S0_MASK                       equ 0001h
CLC8SEL2_D3S1_POSN                       equ 0001h
CLC8SEL2_D3S1_POSITION                   equ 0001h
CLC8SEL2_D3S1_SIZE                       equ 0001h
CLC8SEL2_D3S1_LENGTH                     equ 0001h
CLC8SEL2_D3S1_MASK                       equ 0002h
CLC8SEL2_D3S2_POSN                       equ 0002h
CLC8SEL2_D3S2_POSITION                   equ 0002h
CLC8SEL2_D3S2_SIZE                       equ 0001h
CLC8SEL2_D3S2_LENGTH                     equ 0001h
CLC8SEL2_D3S2_MASK                       equ 0004h
CLC8SEL2_D3S3_POSN                       equ 0003h
CLC8SEL2_D3S3_POSITION                   equ 0003h
CLC8SEL2_D3S3_SIZE                       equ 0001h
CLC8SEL2_D3S3_LENGTH                     equ 0001h
CLC8SEL2_D3S3_MASK                       equ 0008h
CLC8SEL2_D3S4_POSN                       equ 0004h
CLC8SEL2_D3S4_POSITION                   equ 0004h
CLC8SEL2_D3S4_SIZE                       equ 0001h
CLC8SEL2_D3S4_LENGTH                     equ 0001h
CLC8SEL2_D3S4_MASK                       equ 0010h
CLC8SEL2_D3S5_POSN                       equ 0005h
CLC8SEL2_D3S5_POSITION                   equ 0005h
CLC8SEL2_D3S5_SIZE                       equ 0001h
CLC8SEL2_D3S5_LENGTH                     equ 0001h
CLC8SEL2_D3S5_MASK                       equ 0020h
CLC8SEL2_D3S6_POSN                       equ 0006h
CLC8SEL2_D3S6_POSITION                   equ 0006h
CLC8SEL2_D3S6_SIZE                       equ 0001h
CLC8SEL2_D3S6_LENGTH                     equ 0001h
CLC8SEL2_D3S6_MASK                       equ 0040h
CLC8SEL2_D3S7_POSN                       equ 0007h
CLC8SEL2_D3S7_POSITION                   equ 0007h
CLC8SEL2_D3S7_SIZE                       equ 0001h
CLC8SEL2_D3S7_LENGTH                     equ 0001h
CLC8SEL2_D3S7_MASK                       equ 0080h
CLC8SEL2_LC8D3S0_POSN                    equ 0000h
CLC8SEL2_LC8D3S0_POSITION                equ 0000h
CLC8SEL2_LC8D3S0_SIZE                    equ 0001h
CLC8SEL2_LC8D3S0_LENGTH                  equ 0001h
CLC8SEL2_LC8D3S0_MASK                    equ 0001h
CLC8SEL2_LC8D3S1_POSN                    equ 0001h
CLC8SEL2_LC8D3S1_POSITION                equ 0001h
CLC8SEL2_LC8D3S1_SIZE                    equ 0001h
CLC8SEL2_LC8D3S1_LENGTH                  equ 0001h
CLC8SEL2_LC8D3S1_MASK                    equ 0002h
CLC8SEL2_LC8D3S2_POSN                    equ 0002h
CLC8SEL2_LC8D3S2_POSITION                equ 0002h
CLC8SEL2_LC8D3S2_SIZE                    equ 0001h
CLC8SEL2_LC8D3S2_LENGTH                  equ 0001h
CLC8SEL2_LC8D3S2_MASK                    equ 0004h
CLC8SEL2_LC8D3S3_POSN                    equ 0003h
CLC8SEL2_LC8D3S3_POSITION                equ 0003h
CLC8SEL2_LC8D3S3_SIZE                    equ 0001h
CLC8SEL2_LC8D3S3_LENGTH                  equ 0001h
CLC8SEL2_LC8D3S3_MASK                    equ 0008h
CLC8SEL2_LC8D3S4_POSN                    equ 0004h
CLC8SEL2_LC8D3S4_POSITION                equ 0004h
CLC8SEL2_LC8D3S4_SIZE                    equ 0001h
CLC8SEL2_LC8D3S4_LENGTH                  equ 0001h
CLC8SEL2_LC8D3S4_MASK                    equ 0010h
CLC8SEL2_LC8D3S5_POSN                    equ 0005h
CLC8SEL2_LC8D3S5_POSITION                equ 0005h
CLC8SEL2_LC8D3S5_SIZE                    equ 0001h
CLC8SEL2_LC8D3S5_LENGTH                  equ 0001h
CLC8SEL2_LC8D3S5_MASK                    equ 0020h
CLC8SEL2_LC8D3S6_POSN                    equ 0006h
CLC8SEL2_LC8D3S6_POSITION                equ 0006h
CLC8SEL2_LC8D3S6_SIZE                    equ 0001h
CLC8SEL2_LC8D3S6_LENGTH                  equ 0001h
CLC8SEL2_LC8D3S6_MASK                    equ 0040h
CLC8SEL2_LC8D3S7_POSN                    equ 0007h
CLC8SEL2_LC8D3S7_POSITION                equ 0007h
CLC8SEL2_LC8D3S7_SIZE                    equ 0001h
CLC8SEL2_LC8D3S7_LENGTH                  equ 0001h
CLC8SEL2_LC8D3S7_MASK                    equ 0080h

// Register: CLC8SEL3
#define CLC8SEL3 CLC8SEL3
CLC8SEL3                                 equ 0E72h
// bitfield definitions
CLC8SEL3_D4S_POSN                        equ 0000h
CLC8SEL3_D4S_POSITION                    equ 0000h
CLC8SEL3_D4S_SIZE                        equ 0008h
CLC8SEL3_D4S_LENGTH                      equ 0008h
CLC8SEL3_D4S_MASK                        equ 00FFh
CLC8SEL3_LC8D4S_POSN                     equ 0000h
CLC8SEL3_LC8D4S_POSITION                 equ 0000h
CLC8SEL3_LC8D4S_SIZE                     equ 0008h
CLC8SEL3_LC8D4S_LENGTH                   equ 0008h
CLC8SEL3_LC8D4S_MASK                     equ 00FFh
CLC8SEL3_D4S0_POSN                       equ 0000h
CLC8SEL3_D4S0_POSITION                   equ 0000h
CLC8SEL3_D4S0_SIZE                       equ 0001h
CLC8SEL3_D4S0_LENGTH                     equ 0001h
CLC8SEL3_D4S0_MASK                       equ 0001h
CLC8SEL3_D4S1_POSN                       equ 0001h
CLC8SEL3_D4S1_POSITION                   equ 0001h
CLC8SEL3_D4S1_SIZE                       equ 0001h
CLC8SEL3_D4S1_LENGTH                     equ 0001h
CLC8SEL3_D4S1_MASK                       equ 0002h
CLC8SEL3_D4S2_POSN                       equ 0002h
CLC8SEL3_D4S2_POSITION                   equ 0002h
CLC8SEL3_D4S2_SIZE                       equ 0001h
CLC8SEL3_D4S2_LENGTH                     equ 0001h
CLC8SEL3_D4S2_MASK                       equ 0004h
CLC8SEL3_D4S3_POSN                       equ 0003h
CLC8SEL3_D4S3_POSITION                   equ 0003h
CLC8SEL3_D4S3_SIZE                       equ 0001h
CLC8SEL3_D4S3_LENGTH                     equ 0001h
CLC8SEL3_D4S3_MASK                       equ 0008h
CLC8SEL3_D4S4_POSN                       equ 0004h
CLC8SEL3_D4S4_POSITION                   equ 0004h
CLC8SEL3_D4S4_SIZE                       equ 0001h
CLC8SEL3_D4S4_LENGTH                     equ 0001h
CLC8SEL3_D4S4_MASK                       equ 0010h
CLC8SEL3_D4S5_POSN                       equ 0005h
CLC8SEL3_D4S5_POSITION                   equ 0005h
CLC8SEL3_D4S5_SIZE                       equ 0001h
CLC8SEL3_D4S5_LENGTH                     equ 0001h
CLC8SEL3_D4S5_MASK                       equ 0020h
CLC8SEL3_D4S6_POSN                       equ 0006h
CLC8SEL3_D4S6_POSITION                   equ 0006h
CLC8SEL3_D4S6_SIZE                       equ 0001h
CLC8SEL3_D4S6_LENGTH                     equ 0001h
CLC8SEL3_D4S6_MASK                       equ 0040h
CLC8SEL3_D4S7_POSN                       equ 0007h
CLC8SEL3_D4S7_POSITION                   equ 0007h
CLC8SEL3_D4S7_SIZE                       equ 0001h
CLC8SEL3_D4S7_LENGTH                     equ 0001h
CLC8SEL3_D4S7_MASK                       equ 0080h
CLC8SEL3_LC8D4S0_POSN                    equ 0000h
CLC8SEL3_LC8D4S0_POSITION                equ 0000h
CLC8SEL3_LC8D4S0_SIZE                    equ 0001h
CLC8SEL3_LC8D4S0_LENGTH                  equ 0001h
CLC8SEL3_LC8D4S0_MASK                    equ 0001h
CLC8SEL3_LC8D4S1_POSN                    equ 0001h
CLC8SEL3_LC8D4S1_POSITION                equ 0001h
CLC8SEL3_LC8D4S1_SIZE                    equ 0001h
CLC8SEL3_LC8D4S1_LENGTH                  equ 0001h
CLC8SEL3_LC8D4S1_MASK                    equ 0002h
CLC8SEL3_LC8D4S2_POSN                    equ 0002h
CLC8SEL3_LC8D4S2_POSITION                equ 0002h
CLC8SEL3_LC8D4S2_SIZE                    equ 0001h
CLC8SEL3_LC8D4S2_LENGTH                  equ 0001h
CLC8SEL3_LC8D4S2_MASK                    equ 0004h
CLC8SEL3_LC8D4S3_POSN                    equ 0003h
CLC8SEL3_LC8D4S3_POSITION                equ 0003h
CLC8SEL3_LC8D4S3_SIZE                    equ 0001h
CLC8SEL3_LC8D4S3_LENGTH                  equ 0001h
CLC8SEL3_LC8D4S3_MASK                    equ 0008h
CLC8SEL3_LC8D4S4_POSN                    equ 0004h
CLC8SEL3_LC8D4S4_POSITION                equ 0004h
CLC8SEL3_LC8D4S4_SIZE                    equ 0001h
CLC8SEL3_LC8D4S4_LENGTH                  equ 0001h
CLC8SEL3_LC8D4S4_MASK                    equ 0010h
CLC8SEL3_LC8D4S5_POSN                    equ 0005h
CLC8SEL3_LC8D4S5_POSITION                equ 0005h
CLC8SEL3_LC8D4S5_SIZE                    equ 0001h
CLC8SEL3_LC8D4S5_LENGTH                  equ 0001h
CLC8SEL3_LC8D4S5_MASK                    equ 0020h
CLC8SEL3_LC8D4S6_POSN                    equ 0006h
CLC8SEL3_LC8D4S6_POSITION                equ 0006h
CLC8SEL3_LC8D4S6_SIZE                    equ 0001h
CLC8SEL3_LC8D4S6_LENGTH                  equ 0001h
CLC8SEL3_LC8D4S6_MASK                    equ 0040h
CLC8SEL3_LC8D4S7_POSN                    equ 0007h
CLC8SEL3_LC8D4S7_POSITION                equ 0007h
CLC8SEL3_LC8D4S7_SIZE                    equ 0001h
CLC8SEL3_LC8D4S7_LENGTH                  equ 0001h
CLC8SEL3_LC8D4S7_MASK                    equ 0080h

// Register: CLC8GLS0
#define CLC8GLS0 CLC8GLS0
CLC8GLS0                                 equ 0E73h
// bitfield definitions
CLC8GLS0_G1D1N_POSN                      equ 0000h
CLC8GLS0_G1D1N_POSITION                  equ 0000h
CLC8GLS0_G1D1N_SIZE                      equ 0001h
CLC8GLS0_G1D1N_LENGTH                    equ 0001h
CLC8GLS0_G1D1N_MASK                      equ 0001h
CLC8GLS0_G1D1T_POSN                      equ 0001h
CLC8GLS0_G1D1T_POSITION                  equ 0001h
CLC8GLS0_G1D1T_SIZE                      equ 0001h
CLC8GLS0_G1D1T_LENGTH                    equ 0001h
CLC8GLS0_G1D1T_MASK                      equ 0002h
CLC8GLS0_G1D2N_POSN                      equ 0002h
CLC8GLS0_G1D2N_POSITION                  equ 0002h
CLC8GLS0_G1D2N_SIZE                      equ 0001h
CLC8GLS0_G1D2N_LENGTH                    equ 0001h
CLC8GLS0_G1D2N_MASK                      equ 0004h
CLC8GLS0_G1D2T_POSN                      equ 0003h
CLC8GLS0_G1D2T_POSITION                  equ 0003h
CLC8GLS0_G1D2T_SIZE                      equ 0001h
CLC8GLS0_G1D2T_LENGTH                    equ 0001h
CLC8GLS0_G1D2T_MASK                      equ 0008h
CLC8GLS0_G1D3N_POSN                      equ 0004h
CLC8GLS0_G1D3N_POSITION                  equ 0004h
CLC8GLS0_G1D3N_SIZE                      equ 0001h
CLC8GLS0_G1D3N_LENGTH                    equ 0001h
CLC8GLS0_G1D3N_MASK                      equ 0010h
CLC8GLS0_G1D3T_POSN                      equ 0005h
CLC8GLS0_G1D3T_POSITION                  equ 0005h
CLC8GLS0_G1D3T_SIZE                      equ 0001h
CLC8GLS0_G1D3T_LENGTH                    equ 0001h
CLC8GLS0_G1D3T_MASK                      equ 0020h
CLC8GLS0_G1D4N_POSN                      equ 0006h
CLC8GLS0_G1D4N_POSITION                  equ 0006h
CLC8GLS0_G1D4N_SIZE                      equ 0001h
CLC8GLS0_G1D4N_LENGTH                    equ 0001h
CLC8GLS0_G1D4N_MASK                      equ 0040h
CLC8GLS0_G1D4T_POSN                      equ 0007h
CLC8GLS0_G1D4T_POSITION                  equ 0007h
CLC8GLS0_G1D4T_SIZE                      equ 0001h
CLC8GLS0_G1D4T_LENGTH                    equ 0001h
CLC8GLS0_G1D4T_MASK                      equ 0080h
CLC8GLS0_LC8G1D1N_POSN                   equ 0000h
CLC8GLS0_LC8G1D1N_POSITION               equ 0000h
CLC8GLS0_LC8G1D1N_SIZE                   equ 0001h
CLC8GLS0_LC8G1D1N_LENGTH                 equ 0001h
CLC8GLS0_LC8G1D1N_MASK                   equ 0001h
CLC8GLS0_LC8G1D1T_POSN                   equ 0001h
CLC8GLS0_LC8G1D1T_POSITION               equ 0001h
CLC8GLS0_LC8G1D1T_SIZE                   equ 0001h
CLC8GLS0_LC8G1D1T_LENGTH                 equ 0001h
CLC8GLS0_LC8G1D1T_MASK                   equ 0002h
CLC8GLS0_LC8G1D2N_POSN                   equ 0002h
CLC8GLS0_LC8G1D2N_POSITION               equ 0002h
CLC8GLS0_LC8G1D2N_SIZE                   equ 0001h
CLC8GLS0_LC8G1D2N_LENGTH                 equ 0001h
CLC8GLS0_LC8G1D2N_MASK                   equ 0004h
CLC8GLS0_LC8G1D2T_POSN                   equ 0003h
CLC8GLS0_LC8G1D2T_POSITION               equ 0003h
CLC8GLS0_LC8G1D2T_SIZE                   equ 0001h
CLC8GLS0_LC8G1D2T_LENGTH                 equ 0001h
CLC8GLS0_LC8G1D2T_MASK                   equ 0008h
CLC8GLS0_LC8G1D3N_POSN                   equ 0004h
CLC8GLS0_LC8G1D3N_POSITION               equ 0004h
CLC8GLS0_LC8G1D3N_SIZE                   equ 0001h
CLC8GLS0_LC8G1D3N_LENGTH                 equ 0001h
CLC8GLS0_LC8G1D3N_MASK                   equ 0010h
CLC8GLS0_LC8G1D3T_POSN                   equ 0005h
CLC8GLS0_LC8G1D3T_POSITION               equ 0005h
CLC8GLS0_LC8G1D3T_SIZE                   equ 0001h
CLC8GLS0_LC8G1D3T_LENGTH                 equ 0001h
CLC8GLS0_LC8G1D3T_MASK                   equ 0020h
CLC8GLS0_LC8G1D4N_POSN                   equ 0006h
CLC8GLS0_LC8G1D4N_POSITION               equ 0006h
CLC8GLS0_LC8G1D4N_SIZE                   equ 0001h
CLC8GLS0_LC8G1D4N_LENGTH                 equ 0001h
CLC8GLS0_LC8G1D4N_MASK                   equ 0040h
CLC8GLS0_LC8G1D4T_POSN                   equ 0007h
CLC8GLS0_LC8G1D4T_POSITION               equ 0007h
CLC8GLS0_LC8G1D4T_SIZE                   equ 0001h
CLC8GLS0_LC8G1D4T_LENGTH                 equ 0001h
CLC8GLS0_LC8G1D4T_MASK                   equ 0080h

// Register: CLC8GLS1
#define CLC8GLS1 CLC8GLS1
CLC8GLS1                                 equ 0E74h
// bitfield definitions
CLC8GLS1_G2D1N_POSN                      equ 0000h
CLC8GLS1_G2D1N_POSITION                  equ 0000h
CLC8GLS1_G2D1N_SIZE                      equ 0001h
CLC8GLS1_G2D1N_LENGTH                    equ 0001h
CLC8GLS1_G2D1N_MASK                      equ 0001h
CLC8GLS1_G2D1T_POSN                      equ 0001h
CLC8GLS1_G2D1T_POSITION                  equ 0001h
CLC8GLS1_G2D1T_SIZE                      equ 0001h
CLC8GLS1_G2D1T_LENGTH                    equ 0001h
CLC8GLS1_G2D1T_MASK                      equ 0002h
CLC8GLS1_G2D2N_POSN                      equ 0002h
CLC8GLS1_G2D2N_POSITION                  equ 0002h
CLC8GLS1_G2D2N_SIZE                      equ 0001h
CLC8GLS1_G2D2N_LENGTH                    equ 0001h
CLC8GLS1_G2D2N_MASK                      equ 0004h
CLC8GLS1_G2D2T_POSN                      equ 0003h
CLC8GLS1_G2D2T_POSITION                  equ 0003h
CLC8GLS1_G2D2T_SIZE                      equ 0001h
CLC8GLS1_G2D2T_LENGTH                    equ 0001h
CLC8GLS1_G2D2T_MASK                      equ 0008h
CLC8GLS1_G2D3N_POSN                      equ 0004h
CLC8GLS1_G2D3N_POSITION                  equ 0004h
CLC8GLS1_G2D3N_SIZE                      equ 0001h
CLC8GLS1_G2D3N_LENGTH                    equ 0001h
CLC8GLS1_G2D3N_MASK                      equ 0010h
CLC8GLS1_G2D3T_POSN                      equ 0005h
CLC8GLS1_G2D3T_POSITION                  equ 0005h
CLC8GLS1_G2D3T_SIZE                      equ 0001h
CLC8GLS1_G2D3T_LENGTH                    equ 0001h
CLC8GLS1_G2D3T_MASK                      equ 0020h
CLC8GLS1_G2D4N_POSN                      equ 0006h
CLC8GLS1_G2D4N_POSITION                  equ 0006h
CLC8GLS1_G2D4N_SIZE                      equ 0001h
CLC8GLS1_G2D4N_LENGTH                    equ 0001h
CLC8GLS1_G2D4N_MASK                      equ 0040h
CLC8GLS1_G2D4T_POSN                      equ 0007h
CLC8GLS1_G2D4T_POSITION                  equ 0007h
CLC8GLS1_G2D4T_SIZE                      equ 0001h
CLC8GLS1_G2D4T_LENGTH                    equ 0001h
CLC8GLS1_G2D4T_MASK                      equ 0080h
CLC8GLS1_LC8G2D1N_POSN                   equ 0000h
CLC8GLS1_LC8G2D1N_POSITION               equ 0000h
CLC8GLS1_LC8G2D1N_SIZE                   equ 0001h
CLC8GLS1_LC8G2D1N_LENGTH                 equ 0001h
CLC8GLS1_LC8G2D1N_MASK                   equ 0001h
CLC8GLS1_LC8G2D1T_POSN                   equ 0001h
CLC8GLS1_LC8G2D1T_POSITION               equ 0001h
CLC8GLS1_LC8G2D1T_SIZE                   equ 0001h
CLC8GLS1_LC8G2D1T_LENGTH                 equ 0001h
CLC8GLS1_LC8G2D1T_MASK                   equ 0002h
CLC8GLS1_LC8G2D2N_POSN                   equ 0002h
CLC8GLS1_LC8G2D2N_POSITION               equ 0002h
CLC8GLS1_LC8G2D2N_SIZE                   equ 0001h
CLC8GLS1_LC8G2D2N_LENGTH                 equ 0001h
CLC8GLS1_LC8G2D2N_MASK                   equ 0004h
CLC8GLS1_LC8G2D2T_POSN                   equ 0003h
CLC8GLS1_LC8G2D2T_POSITION               equ 0003h
CLC8GLS1_LC8G2D2T_SIZE                   equ 0001h
CLC8GLS1_LC8G2D2T_LENGTH                 equ 0001h
CLC8GLS1_LC8G2D2T_MASK                   equ 0008h
CLC8GLS1_LC8G2D3N_POSN                   equ 0004h
CLC8GLS1_LC8G2D3N_POSITION               equ 0004h
CLC8GLS1_LC8G2D3N_SIZE                   equ 0001h
CLC8GLS1_LC8G2D3N_LENGTH                 equ 0001h
CLC8GLS1_LC8G2D3N_MASK                   equ 0010h
CLC8GLS1_LC8G2D3T_POSN                   equ 0005h
CLC8GLS1_LC8G2D3T_POSITION               equ 0005h
CLC8GLS1_LC8G2D3T_SIZE                   equ 0001h
CLC8GLS1_LC8G2D3T_LENGTH                 equ 0001h
CLC8GLS1_LC8G2D3T_MASK                   equ 0020h
CLC8GLS1_LC8G2D4N_POSN                   equ 0006h
CLC8GLS1_LC8G2D4N_POSITION               equ 0006h
CLC8GLS1_LC8G2D4N_SIZE                   equ 0001h
CLC8GLS1_LC8G2D4N_LENGTH                 equ 0001h
CLC8GLS1_LC8G2D4N_MASK                   equ 0040h
CLC8GLS1_LC8G2D4T_POSN                   equ 0007h
CLC8GLS1_LC8G2D4T_POSITION               equ 0007h
CLC8GLS1_LC8G2D4T_SIZE                   equ 0001h
CLC8GLS1_LC8G2D4T_LENGTH                 equ 0001h
CLC8GLS1_LC8G2D4T_MASK                   equ 0080h

// Register: CLC8GLS2
#define CLC8GLS2 CLC8GLS2
CLC8GLS2                                 equ 0E75h
// bitfield definitions
CLC8GLS2_G3D1N_POSN                      equ 0000h
CLC8GLS2_G3D1N_POSITION                  equ 0000h
CLC8GLS2_G3D1N_SIZE                      equ 0001h
CLC8GLS2_G3D1N_LENGTH                    equ 0001h
CLC8GLS2_G3D1N_MASK                      equ 0001h
CLC8GLS2_G3D1T_POSN                      equ 0001h
CLC8GLS2_G3D1T_POSITION                  equ 0001h
CLC8GLS2_G3D1T_SIZE                      equ 0001h
CLC8GLS2_G3D1T_LENGTH                    equ 0001h
CLC8GLS2_G3D1T_MASK                      equ 0002h
CLC8GLS2_G3D2N_POSN                      equ 0002h
CLC8GLS2_G3D2N_POSITION                  equ 0002h
CLC8GLS2_G3D2N_SIZE                      equ 0001h
CLC8GLS2_G3D2N_LENGTH                    equ 0001h
CLC8GLS2_G3D2N_MASK                      equ 0004h
CLC8GLS2_G3D2T_POSN                      equ 0003h
CLC8GLS2_G3D2T_POSITION                  equ 0003h
CLC8GLS2_G3D2T_SIZE                      equ 0001h
CLC8GLS2_G3D2T_LENGTH                    equ 0001h
CLC8GLS2_G3D2T_MASK                      equ 0008h
CLC8GLS2_G3D3N_POSN                      equ 0004h
CLC8GLS2_G3D3N_POSITION                  equ 0004h
CLC8GLS2_G3D3N_SIZE                      equ 0001h
CLC8GLS2_G3D3N_LENGTH                    equ 0001h
CLC8GLS2_G3D3N_MASK                      equ 0010h
CLC8GLS2_G3D3T_POSN                      equ 0005h
CLC8GLS2_G3D3T_POSITION                  equ 0005h
CLC8GLS2_G3D3T_SIZE                      equ 0001h
CLC8GLS2_G3D3T_LENGTH                    equ 0001h
CLC8GLS2_G3D3T_MASK                      equ 0020h
CLC8GLS2_G3D4N_POSN                      equ 0006h
CLC8GLS2_G3D4N_POSITION                  equ 0006h
CLC8GLS2_G3D4N_SIZE                      equ 0001h
CLC8GLS2_G3D4N_LENGTH                    equ 0001h
CLC8GLS2_G3D4N_MASK                      equ 0040h
CLC8GLS2_G3D4T_POSN                      equ 0007h
CLC8GLS2_G3D4T_POSITION                  equ 0007h
CLC8GLS2_G3D4T_SIZE                      equ 0001h
CLC8GLS2_G3D4T_LENGTH                    equ 0001h
CLC8GLS2_G3D4T_MASK                      equ 0080h
CLC8GLS2_LC8G3D1N_POSN                   equ 0000h
CLC8GLS2_LC8G3D1N_POSITION               equ 0000h
CLC8GLS2_LC8G3D1N_SIZE                   equ 0001h
CLC8GLS2_LC8G3D1N_LENGTH                 equ 0001h
CLC8GLS2_LC8G3D1N_MASK                   equ 0001h
CLC8GLS2_LC8G3D1T_POSN                   equ 0001h
CLC8GLS2_LC8G3D1T_POSITION               equ 0001h
CLC8GLS2_LC8G3D1T_SIZE                   equ 0001h
CLC8GLS2_LC8G3D1T_LENGTH                 equ 0001h
CLC8GLS2_LC8G3D1T_MASK                   equ 0002h
CLC8GLS2_LC8G3D2N_POSN                   equ 0002h
CLC8GLS2_LC8G3D2N_POSITION               equ 0002h
CLC8GLS2_LC8G3D2N_SIZE                   equ 0001h
CLC8GLS2_LC8G3D2N_LENGTH                 equ 0001h
CLC8GLS2_LC8G3D2N_MASK                   equ 0004h
CLC8GLS2_LC8G3D2T_POSN                   equ 0003h
CLC8GLS2_LC8G3D2T_POSITION               equ 0003h
CLC8GLS2_LC8G3D2T_SIZE                   equ 0001h
CLC8GLS2_LC8G3D2T_LENGTH                 equ 0001h
CLC8GLS2_LC8G3D2T_MASK                   equ 0008h
CLC8GLS2_LC8G3D3N_POSN                   equ 0004h
CLC8GLS2_LC8G3D3N_POSITION               equ 0004h
CLC8GLS2_LC8G3D3N_SIZE                   equ 0001h
CLC8GLS2_LC8G3D3N_LENGTH                 equ 0001h
CLC8GLS2_LC8G3D3N_MASK                   equ 0010h
CLC8GLS2_LC8G3D3T_POSN                   equ 0005h
CLC8GLS2_LC8G3D3T_POSITION               equ 0005h
CLC8GLS2_LC8G3D3T_SIZE                   equ 0001h
CLC8GLS2_LC8G3D3T_LENGTH                 equ 0001h
CLC8GLS2_LC8G3D3T_MASK                   equ 0020h
CLC8GLS2_LC8G3D4N_POSN                   equ 0006h
CLC8GLS2_LC8G3D4N_POSITION               equ 0006h
CLC8GLS2_LC8G3D4N_SIZE                   equ 0001h
CLC8GLS2_LC8G3D4N_LENGTH                 equ 0001h
CLC8GLS2_LC8G3D4N_MASK                   equ 0040h
CLC8GLS2_LC8G3D4T_POSN                   equ 0007h
CLC8GLS2_LC8G3D4T_POSITION               equ 0007h
CLC8GLS2_LC8G3D4T_SIZE                   equ 0001h
CLC8GLS2_LC8G3D4T_LENGTH                 equ 0001h
CLC8GLS2_LC8G3D4T_MASK                   equ 0080h

