GopalSaraf/Practicals/PSDL/include/proc/pic18f27q10.inc
// Register: RX1PPS
#define RX1PPS RX1PPS
RX1PPS                                   equ 0EB0h
// bitfield definitions
RX1PPS_PIN_POSN                          equ 0000h
RX1PPS_PIN_POSITION                      equ 0000h
RX1PPS_PIN_SIZE                          equ 0003h
RX1PPS_PIN_LENGTH                        equ 0003h
RX1PPS_PIN_MASK                          equ 0007h
RX1PPS_PORT_POSN                         equ 0003h
RX1PPS_PORT_POSITION                     equ 0003h
RX1PPS_PORT_SIZE                         equ 0002h
RX1PPS_PORT_LENGTH                       equ 0002h
RX1PPS_PORT_MASK                         equ 0018h
RX1PPS_RXPPS0_POSN                       equ 0000h
RX1PPS_RXPPS0_POSITION                   equ 0000h
RX1PPS_RXPPS0_SIZE                       equ 0001h
RX1PPS_RXPPS0_LENGTH                     equ 0001h
RX1PPS_RXPPS0_MASK                       equ 0001h
RX1PPS_RXPPS1_POSN                       equ 0001h
RX1PPS_RXPPS1_POSITION                   equ 0001h
RX1PPS_RXPPS1_SIZE                       equ 0001h
RX1PPS_RXPPS1_LENGTH                     equ 0001h
RX1PPS_RXPPS1_MASK                       equ 0002h
RX1PPS_RXPPS2_POSN                       equ 0002h
RX1PPS_RXPPS2_POSITION                   equ 0002h
RX1PPS_RXPPS2_SIZE                       equ 0001h
RX1PPS_RXPPS2_LENGTH                     equ 0001h
RX1PPS_RXPPS2_MASK                       equ 0004h
RX1PPS_RXPPS3_POSN                       equ 0003h
RX1PPS_RXPPS3_POSITION                   equ 0003h
RX1PPS_RXPPS3_SIZE                       equ 0001h
RX1PPS_RXPPS3_LENGTH                     equ 0001h
RX1PPS_RXPPS3_MASK                       equ 0008h
RX1PPS_RXPPS4_POSN                       equ 0004h
RX1PPS_RXPPS4_POSITION                   equ 0004h
RX1PPS_RXPPS4_SIZE                       equ 0001h
RX1PPS_RXPPS4_LENGTH                     equ 0001h
RX1PPS_RXPPS4_MASK                       equ 0010h
RX1PPS_RXPPS_POSN                        equ 0000h
RX1PPS_RXPPS_POSITION                    equ 0000h
RX1PPS_RXPPS_SIZE                        equ 0005h
RX1PPS_RXPPS_LENGTH                      equ 0005h
RX1PPS_RXPPS_MASK                        equ 001Fh

// Register: CK1PPS
#define CK1PPS CK1PPS
CK1PPS                                   equ 0EB1h
// bitfield definitions
CK1PPS_PIN_POSN                          equ 0000h
CK1PPS_PIN_POSITION                      equ 0000h
CK1PPS_PIN_SIZE                          equ 0003h
CK1PPS_PIN_LENGTH                        equ 0003h
CK1PPS_PIN_MASK                          equ 0007h
CK1PPS_PORT_POSN                         equ 0003h
CK1PPS_PORT_POSITION                     equ 0003h
CK1PPS_PORT_SIZE                         equ 0002h
CK1PPS_PORT_LENGTH                       equ 0002h
CK1PPS_PORT_MASK                         equ 0018h
CK1PPS_TXPPS0_POSN                       equ 0000h
CK1PPS_TXPPS0_POSITION                   equ 0000h
CK1PPS_TXPPS0_SIZE                       equ 0001h
CK1PPS_TXPPS0_LENGTH                     equ 0001h
CK1PPS_TXPPS0_MASK                       equ 0001h
CK1PPS_TXPPS1_POSN                       equ 0001h
CK1PPS_TXPPS1_POSITION                   equ 0001h
CK1PPS_TXPPS1_SIZE                       equ 0001h
CK1PPS_TXPPS1_LENGTH                     equ 0001h
CK1PPS_TXPPS1_MASK                       equ 0002h
CK1PPS_TXPPS2_POSN                       equ 0002h
CK1PPS_TXPPS2_POSITION                   equ 0002h
CK1PPS_TXPPS2_SIZE                       equ 0001h
CK1PPS_TXPPS2_LENGTH                     equ 0001h
CK1PPS_TXPPS2_MASK                       equ 0004h
CK1PPS_TXPPS3_POSN                       equ 0003h
CK1PPS_TXPPS3_POSITION                   equ 0003h
CK1PPS_TXPPS3_SIZE                       equ 0001h
CK1PPS_TXPPS3_LENGTH                     equ 0001h
CK1PPS_TXPPS3_MASK                       equ 0008h
CK1PPS_TXPPS4_POSN                       equ 0004h
CK1PPS_TXPPS4_POSITION                   equ 0004h
CK1PPS_TXPPS4_SIZE                       equ 0001h
CK1PPS_TXPPS4_LENGTH                     equ 0001h
CK1PPS_TXPPS4_MASK                       equ 0010h
CK1PPS_TXPPS_POSN                        equ 0000h
CK1PPS_TXPPS_POSITION                    equ 0000h
CK1PPS_TXPPS_SIZE                        equ 0005h
CK1PPS_TXPPS_LENGTH                      equ 0005h
CK1PPS_TXPPS_MASK                        equ 001Fh

// Register: SSP1CLKPPS
#define SSP1CLKPPS SSP1CLKPPS
SSP1CLKPPS                               equ 0EB2h
// bitfield definitions
SSP1CLKPPS_PIN_POSN                      equ 0000h
SSP1CLKPPS_PIN_POSITION                  equ 0000h
SSP1CLKPPS_PIN_SIZE                      equ 0003h
SSP1CLKPPS_PIN_LENGTH                    equ 0003h
SSP1CLKPPS_PIN_MASK                      equ 0007h
SSP1CLKPPS_PORT_POSN                     equ 0003h
SSP1CLKPPS_PORT_POSITION                 equ 0003h
SSP1CLKPPS_PORT_SIZE                     equ 0002h
SSP1CLKPPS_PORT_LENGTH                   equ 0002h
SSP1CLKPPS_PORT_MASK                     equ 0018h
SSP1CLKPPS_SSPCLKPPS0_POSN               equ 0000h
SSP1CLKPPS_SSPCLKPPS0_POSITION           equ 0000h
SSP1CLKPPS_SSPCLKPPS0_SIZE               equ 0001h
SSP1CLKPPS_SSPCLKPPS0_LENGTH             equ 0001h
SSP1CLKPPS_SSPCLKPPS0_MASK               equ 0001h
SSP1CLKPPS_SSPCLKPPS1_POSN               equ 0001h
SSP1CLKPPS_SSPCLKPPS1_POSITION           equ 0001h
SSP1CLKPPS_SSPCLKPPS1_SIZE               equ 0001h
SSP1CLKPPS_SSPCLKPPS1_LENGTH             equ 0001h
SSP1CLKPPS_SSPCLKPPS1_MASK               equ 0002h
SSP1CLKPPS_SSPCLKPPS2_POSN               equ 0002h
SSP1CLKPPS_SSPCLKPPS2_POSITION           equ 0002h
SSP1CLKPPS_SSPCLKPPS2_SIZE               equ 0001h
SSP1CLKPPS_SSPCLKPPS2_LENGTH             equ 0001h
SSP1CLKPPS_SSPCLKPPS2_MASK               equ 0004h
SSP1CLKPPS_SSPCLKPPS3_POSN               equ 0003h
SSP1CLKPPS_SSPCLKPPS3_POSITION           equ 0003h
SSP1CLKPPS_SSPCLKPPS3_SIZE               equ 0001h
SSP1CLKPPS_SSPCLKPPS3_LENGTH             equ 0001h
SSP1CLKPPS_SSPCLKPPS3_MASK               equ 0008h
SSP1CLKPPS_SSPCLKPPS4_POSN               equ 0004h
SSP1CLKPPS_SSPCLKPPS4_POSITION           equ 0004h
SSP1CLKPPS_SSPCLKPPS4_SIZE               equ 0001h
SSP1CLKPPS_SSPCLKPPS4_LENGTH             equ 0001h
SSP1CLKPPS_SSPCLKPPS4_MASK               equ 0010h
SSP1CLKPPS_SSP1CLKPPS_POSN               equ 0000h
SSP1CLKPPS_SSP1CLKPPS_POSITION           equ 0000h
SSP1CLKPPS_SSP1CLKPPS_SIZE               equ 0005h
SSP1CLKPPS_SSP1CLKPPS_LENGTH             equ 0005h
SSP1CLKPPS_SSP1CLKPPS_MASK               equ 001Fh
SSP1CLKPPS_SSP1CLKPPS0_POSN              equ 0000h
SSP1CLKPPS_SSP1CLKPPS0_POSITION          equ 0000h
SSP1CLKPPS_SSP1CLKPPS0_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS0_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS0_MASK              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_POSN              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_POSITION          equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_MASK              equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_POSN              equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_POSITION          equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS2_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS2_MASK              equ 0004h
SSP1CLKPPS_SSP1CLKPPS3_POSN              equ 0003h
SSP1CLKPPS_SSP1CLKPPS3_POSITION          equ 0003h
SSP1CLKPPS_SSP1CLKPPS3_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS3_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS3_MASK              equ 0008h
SSP1CLKPPS_SSP1CLKPPS4_POSN              equ 0004h
SSP1CLKPPS_SSP1CLKPPS4_POSITION          equ 0004h
SSP1CLKPPS_SSP1CLKPPS4_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS4_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS4_MASK              equ 0010h
SSP1CLKPPS_SSPCLKPPS_POSN                equ 0000h
SSP1CLKPPS_SSPCLKPPS_POSITION            equ 0000h
SSP1CLKPPS_SSPCLKPPS_SIZE                equ 0005h
SSP1CLKPPS_SSPCLKPPS_LENGTH              equ 0005h
SSP1CLKPPS_SSPCLKPPS_MASK                equ 001Fh

