GopalSaraf/Practicals/PSDL/include/proc/pic18f27q10.inc
// Register: SSP1DATPPS
#define SSP1DATPPS SSP1DATPPS
SSP1DATPPS                               equ 0EB3h
// bitfield definitions
SSP1DATPPS_PIN_POSN                      equ 0000h
SSP1DATPPS_PIN_POSITION                  equ 0000h
SSP1DATPPS_PIN_SIZE                      equ 0003h
SSP1DATPPS_PIN_LENGTH                    equ 0003h
SSP1DATPPS_PIN_MASK                      equ 0007h
SSP1DATPPS_PORT_POSN                     equ 0003h
SSP1DATPPS_PORT_POSITION                 equ 0003h
SSP1DATPPS_PORT_SIZE                     equ 0002h
SSP1DATPPS_PORT_LENGTH                   equ 0002h
SSP1DATPPS_PORT_MASK                     equ 0018h
SSP1DATPPS_SSPDATPPS0_POSN               equ 0000h
SSP1DATPPS_SSPDATPPS0_POSITION           equ 0000h
SSP1DATPPS_SSPDATPPS0_SIZE               equ 0001h
SSP1DATPPS_SSPDATPPS0_LENGTH             equ 0001h
SSP1DATPPS_SSPDATPPS0_MASK               equ 0001h
SSP1DATPPS_SSPDATPPS1_POSN               equ 0001h
SSP1DATPPS_SSPDATPPS1_POSITION           equ 0001h
SSP1DATPPS_SSPDATPPS1_SIZE               equ 0001h
SSP1DATPPS_SSPDATPPS1_LENGTH             equ 0001h
SSP1DATPPS_SSPDATPPS1_MASK               equ 0002h
SSP1DATPPS_SSPDATPPS2_POSN               equ 0002h
SSP1DATPPS_SSPDATPPS2_POSITION           equ 0002h
SSP1DATPPS_SSPDATPPS2_SIZE               equ 0001h
SSP1DATPPS_SSPDATPPS2_LENGTH             equ 0001h
SSP1DATPPS_SSPDATPPS2_MASK               equ 0004h
SSP1DATPPS_SSPDATPPS3_POSN               equ 0003h
SSP1DATPPS_SSPDATPPS3_POSITION           equ 0003h
SSP1DATPPS_SSPDATPPS3_SIZE               equ 0001h
SSP1DATPPS_SSPDATPPS3_LENGTH             equ 0001h
SSP1DATPPS_SSPDATPPS3_MASK               equ 0008h
SSP1DATPPS_SSPDATPPS4_POSN               equ 0004h
SSP1DATPPS_SSPDATPPS4_POSITION           equ 0004h
SSP1DATPPS_SSPDATPPS4_SIZE               equ 0001h
SSP1DATPPS_SSPDATPPS4_LENGTH             equ 0001h
SSP1DATPPS_SSPDATPPS4_MASK               equ 0010h
SSP1DATPPS_SSP1DATPPS_POSN               equ 0000h
SSP1DATPPS_SSP1DATPPS_POSITION           equ 0000h
SSP1DATPPS_SSP1DATPPS_SIZE               equ 0005h
SSP1DATPPS_SSP1DATPPS_LENGTH             equ 0005h
SSP1DATPPS_SSP1DATPPS_MASK               equ 001Fh
SSP1DATPPS_SSP1DATPPS0_POSN              equ 0000h
SSP1DATPPS_SSP1DATPPS0_POSITION          equ 0000h
SSP1DATPPS_SSP1DATPPS0_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS0_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS0_MASK              equ 0001h
SSP1DATPPS_SSP1DATPPS1_POSN              equ 0001h
SSP1DATPPS_SSP1DATPPS1_POSITION          equ 0001h
SSP1DATPPS_SSP1DATPPS1_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS1_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS1_MASK              equ 0002h
SSP1DATPPS_SSP1DATPPS2_POSN              equ 0002h
SSP1DATPPS_SSP1DATPPS2_POSITION          equ 0002h
SSP1DATPPS_SSP1DATPPS2_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS2_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS2_MASK              equ 0004h
SSP1DATPPS_SSP1DATPPS3_POSN              equ 0003h
SSP1DATPPS_SSP1DATPPS3_POSITION          equ 0003h
SSP1DATPPS_SSP1DATPPS3_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS3_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS3_MASK              equ 0008h
SSP1DATPPS_SSP1DATPPS4_POSN              equ 0004h
SSP1DATPPS_SSP1DATPPS4_POSITION          equ 0004h
SSP1DATPPS_SSP1DATPPS4_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS4_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS4_MASK              equ 0010h
SSP1DATPPS_SSPDATPPS_POSN                equ 0000h
SSP1DATPPS_SSPDATPPS_POSITION            equ 0000h
SSP1DATPPS_SSPDATPPS_SIZE                equ 0005h
SSP1DATPPS_SSPDATPPS_LENGTH              equ 0005h
SSP1DATPPS_SSPDATPPS_MASK                equ 001Fh

// Register: SSP1SSPPS
#define SSP1SSPPS SSP1SSPPS
SSP1SSPPS                                equ 0EB4h
// bitfield definitions
SSP1SSPPS_PIN_POSN                       equ 0000h
SSP1SSPPS_PIN_POSITION                   equ 0000h
SSP1SSPPS_PIN_SIZE                       equ 0003h
SSP1SSPPS_PIN_LENGTH                     equ 0003h
SSP1SSPPS_PIN_MASK                       equ 0007h
SSP1SSPPS_PORT_POSN                      equ 0003h
SSP1SSPPS_PORT_POSITION                  equ 0003h
SSP1SSPPS_PORT_SIZE                      equ 0002h
SSP1SSPPS_PORT_LENGTH                    equ 0002h
SSP1SSPPS_PORT_MASK                      equ 0018h
SSP1SSPPS_SSPSSPPS0_POSN                 equ 0000h
SSP1SSPPS_SSPSSPPS0_POSITION             equ 0000h
SSP1SSPPS_SSPSSPPS0_SIZE                 equ 0001h
SSP1SSPPS_SSPSSPPS0_LENGTH               equ 0001h
SSP1SSPPS_SSPSSPPS0_MASK                 equ 0001h
SSP1SSPPS_SSPSSPPS1_POSN                 equ 0001h
SSP1SSPPS_SSPSSPPS1_POSITION             equ 0001h
SSP1SSPPS_SSPSSPPS1_SIZE                 equ 0001h
SSP1SSPPS_SSPSSPPS1_LENGTH               equ 0001h
SSP1SSPPS_SSPSSPPS1_MASK                 equ 0002h
SSP1SSPPS_SSPSSPPS2_POSN                 equ 0002h
SSP1SSPPS_SSPSSPPS2_POSITION             equ 0002h
SSP1SSPPS_SSPSSPPS2_SIZE                 equ 0001h
SSP1SSPPS_SSPSSPPS2_LENGTH               equ 0001h
SSP1SSPPS_SSPSSPPS2_MASK                 equ 0004h
SSP1SSPPS_SSPSSPPS3_POSN                 equ 0003h
SSP1SSPPS_SSPSSPPS3_POSITION             equ 0003h
SSP1SSPPS_SSPSSPPS3_SIZE                 equ 0001h
SSP1SSPPS_SSPSSPPS3_LENGTH               equ 0001h
SSP1SSPPS_SSPSSPPS3_MASK                 equ 0008h
SSP1SSPPS_SSPSSPPS4_POSN                 equ 0004h
SSP1SSPPS_SSPSSPPS4_POSITION             equ 0004h
SSP1SSPPS_SSPSSPPS4_SIZE                 equ 0001h
SSP1SSPPS_SSPSSPPS4_LENGTH               equ 0001h
SSP1SSPPS_SSPSSPPS4_MASK                 equ 0010h
SSP1SSPPS_SSP1SSPPS_POSN                 equ 0000h
SSP1SSPPS_SSP1SSPPS_POSITION             equ 0000h
SSP1SSPPS_SSP1SSPPS_SIZE                 equ 0005h
SSP1SSPPS_SSP1SSPPS_LENGTH               equ 0005h
SSP1SSPPS_SSP1SSPPS_MASK                 equ 001Fh
SSP1SSPPS_SSP1SSPPS0_POSN                equ 0000h
SSP1SSPPS_SSP1SSPPS0_POSITION            equ 0000h
SSP1SSPPS_SSP1SSPPS0_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS0_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS0_MASK                equ 0001h
SSP1SSPPS_SSP1SSPPS1_POSN                equ 0001h
SSP1SSPPS_SSP1SSPPS1_POSITION            equ 0001h
SSP1SSPPS_SSP1SSPPS1_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS1_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS1_MASK                equ 0002h
SSP1SSPPS_SSP1SSPPS2_POSN                equ 0002h
SSP1SSPPS_SSP1SSPPS2_POSITION            equ 0002h
SSP1SSPPS_SSP1SSPPS2_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS2_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS2_MASK                equ 0004h
SSP1SSPPS_SSP1SSPPS3_POSN                equ 0003h
SSP1SSPPS_SSP1SSPPS3_POSITION            equ 0003h
SSP1SSPPS_SSP1SSPPS3_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS3_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS3_MASK                equ 0008h
SSP1SSPPS_SSP1SSPPS4_POSN                equ 0004h
SSP1SSPPS_SSP1SSPPS4_POSITION            equ 0004h
SSP1SSPPS_SSP1SSPPS4_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS4_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS4_MASK                equ 0010h
SSP1SSPPS_SSPSSPPS_POSN                  equ 0000h
SSP1SSPPS_SSPSSPPS_POSITION              equ 0000h
SSP1SSPPS_SSPSSPPS_SIZE                  equ 0005h
SSP1SSPPS_SSPSSPPS_LENGTH                equ 0005h
SSP1SSPPS_SSPSSPPS_MASK                  equ 001Fh

// Register: IPR0
#define IPR0 IPR0
IPR0                                     equ 0EB5h
// bitfield definitions
IPR0_INT0IP_POSN                         equ 0000h
IPR0_INT0IP_POSITION                     equ 0000h
IPR0_INT0IP_SIZE                         equ 0001h
IPR0_INT0IP_LENGTH                       equ 0001h
IPR0_INT0IP_MASK                         equ 0001h
IPR0_INT1IP_POSN                         equ 0001h
IPR0_INT1IP_POSITION                     equ 0001h
IPR0_INT1IP_SIZE                         equ 0001h
IPR0_INT1IP_LENGTH                       equ 0001h
IPR0_INT1IP_MASK                         equ 0002h
IPR0_INT2IP_POSN                         equ 0002h
IPR0_INT2IP_POSITION                     equ 0002h
IPR0_INT2IP_SIZE                         equ 0001h
IPR0_INT2IP_LENGTH                       equ 0001h
IPR0_INT2IP_MASK                         equ 0004h
IPR0_IOCIP_POSN                          equ 0004h
IPR0_IOCIP_POSITION                      equ 0004h
IPR0_IOCIP_SIZE                          equ 0001h
IPR0_IOCIP_LENGTH                        equ 0001h
IPR0_IOCIP_MASK                          equ 0010h
IPR0_TMR0IP_POSN                         equ 0005h
IPR0_TMR0IP_POSITION                     equ 0005h
IPR0_TMR0IP_SIZE                         equ 0001h
IPR0_TMR0IP_LENGTH                       equ 0001h
IPR0_TMR0IP_MASK                         equ 0020h

// Register: IPR1
#define IPR1 IPR1
IPR1                                     equ 0EB6h
// bitfield definitions
IPR1_ADIP_POSN                           equ 0000h
IPR1_ADIP_POSITION                       equ 0000h
IPR1_ADIP_SIZE                           equ 0001h
IPR1_ADIP_LENGTH                         equ 0001h
IPR1_ADIP_MASK                           equ 0001h
IPR1_ADTIP_POSN                          equ 0001h
IPR1_ADTIP_POSITION                      equ 0001h
IPR1_ADTIP_SIZE                          equ 0001h
IPR1_ADTIP_LENGTH                        equ 0001h
IPR1_ADTIP_MASK                          equ 0002h
IPR1_CSWIP_POSN                          equ 0006h
IPR1_CSWIP_POSITION                      equ 0006h
IPR1_CSWIP_SIZE                          equ 0001h
IPR1_CSWIP_LENGTH                        equ 0001h
IPR1_CSWIP_MASK                          equ 0040h
IPR1_OSCFIP_POSN                         equ 0007h
IPR1_OSCFIP_POSITION                     equ 0007h
IPR1_OSCFIP_SIZE                         equ 0001h
IPR1_OSCFIP_LENGTH                       equ 0001h
IPR1_OSCFIP_MASK                         equ 0080h

// Register: IPR2
#define IPR2 IPR2
IPR2                                     equ 0EB7h
// bitfield definitions
IPR2_C1IP_POSN                           equ 0000h
IPR2_C1IP_POSITION                       equ 0000h
IPR2_C1IP_SIZE                           equ 0001h
IPR2_C1IP_LENGTH                         equ 0001h
IPR2_C1IP_MASK                           equ 0001h
IPR2_C2IP_POSN                           equ 0001h
IPR2_C2IP_POSITION                       equ 0001h
IPR2_C2IP_SIZE                           equ 0001h
IPR2_C2IP_LENGTH                         equ 0001h
IPR2_C2IP_MASK                           equ 0002h
IPR2_ZCDIP_POSN                          equ 0006h
IPR2_ZCDIP_POSITION                      equ 0006h
IPR2_ZCDIP_SIZE                          equ 0001h
IPR2_ZCDIP_LENGTH                        equ 0001h
IPR2_ZCDIP_MASK                          equ 0040h
IPR2_HLVDIP_POSN                         equ 0007h
IPR2_HLVDIP_POSITION                     equ 0007h
IPR2_HLVDIP_SIZE                         equ 0001h
IPR2_HLVDIP_LENGTH                       equ 0001h
IPR2_HLVDIP_MASK                         equ 0080h

// Register: IPR3
#define IPR3 IPR3
IPR3                                     equ 0EB8h
// bitfield definitions
IPR3_SSPIP_POSN                          equ 0000h
IPR3_SSPIP_POSITION                      equ 0000h
IPR3_SSPIP_SIZE                          equ 0001h
IPR3_SSPIP_LENGTH                        equ 0001h
IPR3_SSPIP_MASK                          equ 0001h
IPR3_BCLIP_POSN                          equ 0001h
IPR3_BCLIP_POSITION                      equ 0001h
IPR3_BCLIP_SIZE                          equ 0001h
IPR3_BCLIP_LENGTH                        equ 0001h
IPR3_BCLIP_MASK                          equ 0002h
IPR3_SSP2IP_POSN                         equ 0002h
IPR3_SSP2IP_POSITION                     equ 0002h
IPR3_SSP2IP_SIZE                         equ 0001h
IPR3_SSP2IP_LENGTH                       equ 0001h
IPR3_SSP2IP_MASK                         equ 0004h
IPR3_BCL2IP_POSN                         equ 0003h
IPR3_BCL2IP_POSITION                     equ 0003h
IPR3_BCL2IP_SIZE                         equ 0001h
IPR3_BCL2IP_LENGTH                       equ 0001h
IPR3_BCL2IP_MASK                         equ 0008h
IPR3_TXIP_POSN                           equ 0004h
IPR3_TXIP_POSITION                       equ 0004h
IPR3_TXIP_SIZE                           equ 0001h
IPR3_TXIP_LENGTH                         equ 0001h
IPR3_TXIP_MASK                           equ 0010h
IPR3_RCIP_POSN                           equ 0005h
IPR3_RCIP_POSITION                       equ 0005h
IPR3_RCIP_SIZE                           equ 0001h
IPR3_RCIP_LENGTH                         equ 0001h
IPR3_RCIP_MASK                           equ 0020h
IPR3_TX2IP_POSN                          equ 0006h
IPR3_TX2IP_POSITION                      equ 0006h
IPR3_TX2IP_SIZE                          equ 0001h
IPR3_TX2IP_LENGTH                        equ 0001h
IPR3_TX2IP_MASK                          equ 0040h
IPR3_RC2IP_POSN                          equ 0007h
IPR3_RC2IP_POSITION                      equ 0007h
IPR3_RC2IP_SIZE                          equ 0001h
IPR3_RC2IP_LENGTH                        equ 0001h
IPR3_RC2IP_MASK                          equ 0080h
IPR3_SSP1IP_POSN                         equ 0000h
IPR3_SSP1IP_POSITION                     equ 0000h
IPR3_SSP1IP_SIZE                         equ 0001h
IPR3_SSP1IP_LENGTH                       equ 0001h
IPR3_SSP1IP_MASK                         equ 0001h
IPR3_BCL1IP_POSN                         equ 0001h
IPR3_BCL1IP_POSITION                     equ 0001h
IPR3_BCL1IP_SIZE                         equ 0001h
IPR3_BCL1IP_LENGTH                       equ 0001h
IPR3_BCL1IP_MASK                         equ 0002h
IPR3_TX1IP_POSN                          equ 0004h
IPR3_TX1IP_POSITION                      equ 0004h
IPR3_TX1IP_SIZE                          equ 0001h
IPR3_TX1IP_LENGTH                        equ 0001h
IPR3_TX1IP_MASK                          equ 0010h
IPR3_RC1IP_POSN                          equ 0005h
IPR3_RC1IP_POSITION                      equ 0005h
IPR3_RC1IP_SIZE                          equ 0001h
IPR3_RC1IP_LENGTH                        equ 0001h
IPR3_RC1IP_MASK                          equ 0020h

