GopalSaraf/Practicals/PSDL/include/proc/pic18f27q10.inc
// Register: ADPREVH
#define ADPREVH ADPREVH
ADPREVH                                  equ 0F5Dh
// bitfield definitions
ADPREVH_ADPREVH_POSN                     equ 0000h
ADPREVH_ADPREVH_POSITION                 equ 0000h
ADPREVH_ADPREVH_SIZE                     equ 0008h
ADPREVH_ADPREVH_LENGTH                   equ 0008h
ADPREVH_ADPREVH_MASK                     equ 00FFh
ADPREVH_ADPREV8_POSN                     equ 0000h
ADPREVH_ADPREV8_POSITION                 equ 0000h
ADPREVH_ADPREV8_SIZE                     equ 0001h
ADPREVH_ADPREV8_LENGTH                   equ 0001h
ADPREVH_ADPREV8_MASK                     equ 0001h
ADPREVH_ADPREV9_POSN                     equ 0001h
ADPREVH_ADPREV9_POSITION                 equ 0001h
ADPREVH_ADPREV9_SIZE                     equ 0001h
ADPREVH_ADPREV9_LENGTH                   equ 0001h
ADPREVH_ADPREV9_MASK                     equ 0002h
ADPREVH_ADPREV10_POSN                    equ 0002h
ADPREVH_ADPREV10_POSITION                equ 0002h
ADPREVH_ADPREV10_SIZE                    equ 0001h
ADPREVH_ADPREV10_LENGTH                  equ 0001h
ADPREVH_ADPREV10_MASK                    equ 0004h
ADPREVH_ADPREV11_POSN                    equ 0003h
ADPREVH_ADPREV11_POSITION                equ 0003h
ADPREVH_ADPREV11_SIZE                    equ 0001h
ADPREVH_ADPREV11_LENGTH                  equ 0001h
ADPREVH_ADPREV11_MASK                    equ 0008h
ADPREVH_ADPREV12_POSN                    equ 0004h
ADPREVH_ADPREV12_POSITION                equ 0004h
ADPREVH_ADPREV12_SIZE                    equ 0001h
ADPREVH_ADPREV12_LENGTH                  equ 0001h
ADPREVH_ADPREV12_MASK                    equ 0010h
ADPREVH_ADPREV13_POSN                    equ 0005h
ADPREVH_ADPREV13_POSITION                equ 0005h
ADPREVH_ADPREV13_SIZE                    equ 0001h
ADPREVH_ADPREV13_LENGTH                  equ 0001h
ADPREVH_ADPREV13_MASK                    equ 0020h
ADPREVH_ADPREV14_POSN                    equ 0006h
ADPREVH_ADPREV14_POSITION                equ 0006h
ADPREVH_ADPREV14_SIZE                    equ 0001h
ADPREVH_ADPREV14_LENGTH                  equ 0001h
ADPREVH_ADPREV14_MASK                    equ 0040h
ADPREVH_ADPREV15_POSN                    equ 0007h
ADPREVH_ADPREV15_POSITION                equ 0007h
ADPREVH_ADPREV15_SIZE                    equ 0001h
ADPREVH_ADPREV15_LENGTH                  equ 0001h
ADPREVH_ADPREV15_MASK                    equ 0080h

// Register: ADRES
#define ADRES ADRES
ADRES                                    equ 0F5Eh

// Register: ADRESL
#define ADRESL ADRESL
ADRESL                                   equ 0F5Eh
// bitfield definitions
ADRESL_ADRESL_POSN                       equ 0000h
ADRESL_ADRESL_POSITION                   equ 0000h
ADRESL_ADRESL_SIZE                       equ 0008h
ADRESL_ADRESL_LENGTH                     equ 0008h
ADRESL_ADRESL_MASK                       equ 00FFh
ADRESL_ADRES0_POSN                       equ 0000h
ADRESL_ADRES0_POSITION                   equ 0000h
ADRESL_ADRES0_SIZE                       equ 0001h
ADRESL_ADRES0_LENGTH                     equ 0001h
ADRESL_ADRES0_MASK                       equ 0001h
ADRESL_ADRES1_POSN                       equ 0001h
ADRESL_ADRES1_POSITION                   equ 0001h
ADRESL_ADRES1_SIZE                       equ 0001h
ADRESL_ADRES1_LENGTH                     equ 0001h
ADRESL_ADRES1_MASK                       equ 0002h
ADRESL_ADRES2_POSN                       equ 0002h
ADRESL_ADRES2_POSITION                   equ 0002h
ADRESL_ADRES2_SIZE                       equ 0001h
ADRESL_ADRES2_LENGTH                     equ 0001h
ADRESL_ADRES2_MASK                       equ 0004h
ADRESL_ADRES3_POSN                       equ 0003h
ADRESL_ADRES3_POSITION                   equ 0003h
ADRESL_ADRES3_SIZE                       equ 0001h
ADRESL_ADRES3_LENGTH                     equ 0001h
ADRESL_ADRES3_MASK                       equ 0008h
ADRESL_ADRES4_POSN                       equ 0004h
ADRESL_ADRES4_POSITION                   equ 0004h
ADRESL_ADRES4_SIZE                       equ 0001h
ADRESL_ADRES4_LENGTH                     equ 0001h
ADRESL_ADRES4_MASK                       equ 0010h
ADRESL_ADRES5_POSN                       equ 0005h
ADRESL_ADRES5_POSITION                   equ 0005h
ADRESL_ADRES5_SIZE                       equ 0001h
ADRESL_ADRES5_LENGTH                     equ 0001h
ADRESL_ADRES5_MASK                       equ 0020h
ADRESL_ADRES6_POSN                       equ 0006h
ADRESL_ADRES6_POSITION                   equ 0006h
ADRESL_ADRES6_SIZE                       equ 0001h
ADRESL_ADRES6_LENGTH                     equ 0001h
ADRESL_ADRES6_MASK                       equ 0040h
ADRESL_ADRES7_POSN                       equ 0007h
ADRESL_ADRES7_POSITION                   equ 0007h
ADRESL_ADRES7_SIZE                       equ 0001h
ADRESL_ADRES7_LENGTH                     equ 0001h
ADRESL_ADRES7_MASK                       equ 0080h

// Register: ADRESH
#define ADRESH ADRESH
ADRESH                                   equ 0F5Fh
// bitfield definitions
ADRESH_ADRES8_POSN                       equ 0000h
ADRESH_ADRES8_POSITION                   equ 0000h
ADRESH_ADRES8_SIZE                       equ 0001h
ADRESH_ADRES8_LENGTH                     equ 0001h
ADRESH_ADRES8_MASK                       equ 0001h
ADRESH_ADRES9_POSN                       equ 0001h
ADRESH_ADRES9_POSITION                   equ 0001h
ADRESH_ADRES9_SIZE                       equ 0001h
ADRESH_ADRES9_LENGTH                     equ 0001h
ADRESH_ADRES9_MASK                       equ 0002h
ADRESH_ADRES10_POSN                      equ 0002h
ADRESH_ADRES10_POSITION                  equ 0002h
ADRESH_ADRES10_SIZE                      equ 0001h
ADRESH_ADRES10_LENGTH                    equ 0001h
ADRESH_ADRES10_MASK                      equ 0004h
ADRESH_ADRES11_POSN                      equ 0003h
ADRESH_ADRES11_POSITION                  equ 0003h
ADRESH_ADRES11_SIZE                      equ 0001h
ADRESH_ADRES11_LENGTH                    equ 0001h
ADRESH_ADRES11_MASK                      equ 0008h
ADRESH_ADRES12_POSN                      equ 0004h
ADRESH_ADRES12_POSITION                  equ 0004h
ADRESH_ADRES12_SIZE                      equ 0001h
ADRESH_ADRES12_LENGTH                    equ 0001h
ADRESH_ADRES12_MASK                      equ 0010h
ADRESH_ADRES13_POSN                      equ 0005h
ADRESH_ADRES13_POSITION                  equ 0005h
ADRESH_ADRES13_SIZE                      equ 0001h
ADRESH_ADRES13_LENGTH                    equ 0001h
ADRESH_ADRES13_MASK                      equ 0020h
ADRESH_ADRES14_POSN                      equ 0006h
ADRESH_ADRES14_POSITION                  equ 0006h
ADRESH_ADRES14_SIZE                      equ 0001h
ADRESH_ADRES14_LENGTH                    equ 0001h
ADRESH_ADRES14_MASK                      equ 0040h
ADRESH_ADRES15_POSN                      equ 0007h
ADRESH_ADRES15_POSITION                  equ 0007h
ADRESH_ADRES15_SIZE                      equ 0001h
ADRESH_ADRES15_LENGTH                    equ 0001h
ADRESH_ADRES15_MASK                      equ 0080h

// Register: ADSTAT
#define ADSTAT ADSTAT
ADSTAT                                   equ 0F60h
// bitfield definitions
ADSTAT_ADSTAT_POSN                       equ 0000h
ADSTAT_ADSTAT_POSITION                   equ 0000h
ADSTAT_ADSTAT_SIZE                       equ 0003h
ADSTAT_ADSTAT_LENGTH                     equ 0003h
ADSTAT_ADSTAT_MASK                       equ 0007h
ADSTAT_ADMATH_POSN                       equ 0004h
ADSTAT_ADMATH_POSITION                   equ 0004h
ADSTAT_ADMATH_SIZE                       equ 0001h
ADSTAT_ADMATH_LENGTH                     equ 0001h
ADSTAT_ADMATH_MASK                       equ 0010h
ADSTAT_ADLTHR_POSN                       equ 0005h
ADSTAT_ADLTHR_POSITION                   equ 0005h
ADSTAT_ADLTHR_SIZE                       equ 0001h
ADSTAT_ADLTHR_LENGTH                     equ 0001h
ADSTAT_ADLTHR_MASK                       equ 0020h
ADSTAT_ADUTHR_POSN                       equ 0006h
ADSTAT_ADUTHR_POSITION                   equ 0006h
ADSTAT_ADUTHR_SIZE                       equ 0001h
ADSTAT_ADUTHR_LENGTH                     equ 0001h
ADSTAT_ADUTHR_MASK                       equ 0040h
ADSTAT_ADAOV_POSN                        equ 0007h
ADSTAT_ADAOV_POSITION                    equ 0007h
ADSTAT_ADAOV_SIZE                        equ 0001h
ADSTAT_ADAOV_LENGTH                      equ 0001h
ADSTAT_ADAOV_MASK                        equ 0080h
ADSTAT_ADSTAT0_POSN                      equ 0000h
ADSTAT_ADSTAT0_POSITION                  equ 0000h
ADSTAT_ADSTAT0_SIZE                      equ 0001h
ADSTAT_ADSTAT0_LENGTH                    equ 0001h
ADSTAT_ADSTAT0_MASK                      equ 0001h
ADSTAT_ADSTAT1_POSN                      equ 0001h
ADSTAT_ADSTAT1_POSITION                  equ 0001h
ADSTAT_ADSTAT1_SIZE                      equ 0001h
ADSTAT_ADSTAT1_LENGTH                    equ 0001h
ADSTAT_ADSTAT1_MASK                      equ 0002h
ADSTAT_ADSTAT2_POSN                      equ 0002h
ADSTAT_ADSTAT2_POSITION                  equ 0002h
ADSTAT_ADSTAT2_SIZE                      equ 0001h
ADSTAT_ADSTAT2_LENGTH                    equ 0001h
ADSTAT_ADSTAT2_MASK                      equ 0004h

// Register: ADRPT
#define ADRPT ADRPT
ADRPT                                    equ 0F61h
// bitfield definitions
ADRPT_ADRPT_POSN                         equ 0000h
ADRPT_ADRPT_POSITION                     equ 0000h
ADRPT_ADRPT_SIZE                         equ 0008h
ADRPT_ADRPT_LENGTH                       equ 0008h
ADRPT_ADRPT_MASK                         equ 00FFh
ADRPT_ADRPT0_POSN                        equ 0000h
ADRPT_ADRPT0_POSITION                    equ 0000h
ADRPT_ADRPT0_SIZE                        equ 0001h
ADRPT_ADRPT0_LENGTH                      equ 0001h
ADRPT_ADRPT0_MASK                        equ 0001h
ADRPT_ADRPT1_POSN                        equ 0001h
ADRPT_ADRPT1_POSITION                    equ 0001h
ADRPT_ADRPT1_SIZE                        equ 0001h
ADRPT_ADRPT1_LENGTH                      equ 0001h
ADRPT_ADRPT1_MASK                        equ 0002h
ADRPT_ADRPT2_POSN                        equ 0002h
ADRPT_ADRPT2_POSITION                    equ 0002h
ADRPT_ADRPT2_SIZE                        equ 0001h
ADRPT_ADRPT2_LENGTH                      equ 0001h
ADRPT_ADRPT2_MASK                        equ 0004h
ADRPT_ADRPT3_POSN                        equ 0003h
ADRPT_ADRPT3_POSITION                    equ 0003h
ADRPT_ADRPT3_SIZE                        equ 0001h
ADRPT_ADRPT3_LENGTH                      equ 0001h
ADRPT_ADRPT3_MASK                        equ 0008h
ADRPT_ADRPT4_POSN                        equ 0004h
ADRPT_ADRPT4_POSITION                    equ 0004h
ADRPT_ADRPT4_SIZE                        equ 0001h
ADRPT_ADRPT4_LENGTH                      equ 0001h
ADRPT_ADRPT4_MASK                        equ 0010h
ADRPT_ADRPT5_POSN                        equ 0005h
ADRPT_ADRPT5_POSITION                    equ 0005h
ADRPT_ADRPT5_SIZE                        equ 0001h
ADRPT_ADRPT5_LENGTH                      equ 0001h
ADRPT_ADRPT5_MASK                        equ 0020h
ADRPT_ADRPT6_POSN                        equ 0006h
ADRPT_ADRPT6_POSITION                    equ 0006h
ADRPT_ADRPT6_SIZE                        equ 0001h
ADRPT_ADRPT6_LENGTH                      equ 0001h
ADRPT_ADRPT6_MASK                        equ 0040h
ADRPT_ADRPT7_POSN                        equ 0007h
ADRPT_ADRPT7_POSITION                    equ 0007h
ADRPT_ADRPT7_SIZE                        equ 0001h
ADRPT_ADRPT7_LENGTH                      equ 0001h
ADRPT_ADRPT7_MASK                        equ 0080h

// Register: ADCNT
#define ADCNT ADCNT
ADCNT                                    equ 0F62h
// bitfield definitions
ADCNT_ADCNT_POSN                         equ 0000h
ADCNT_ADCNT_POSITION                     equ 0000h
ADCNT_ADCNT_SIZE                         equ 0008h
ADCNT_ADCNT_LENGTH                       equ 0008h
ADCNT_ADCNT_MASK                         equ 00FFh
ADCNT_ADCNT0_POSN                        equ 0000h
ADCNT_ADCNT0_POSITION                    equ 0000h
ADCNT_ADCNT0_SIZE                        equ 0001h
ADCNT_ADCNT0_LENGTH                      equ 0001h
ADCNT_ADCNT0_MASK                        equ 0001h
ADCNT_ADCNT1_POSN                        equ 0001h
ADCNT_ADCNT1_POSITION                    equ 0001h
ADCNT_ADCNT1_SIZE                        equ 0001h
ADCNT_ADCNT1_LENGTH                      equ 0001h
ADCNT_ADCNT1_MASK                        equ 0002h
ADCNT_ADCNT2_POSN                        equ 0002h
ADCNT_ADCNT2_POSITION                    equ 0002h
ADCNT_ADCNT2_SIZE                        equ 0001h
ADCNT_ADCNT2_LENGTH                      equ 0001h
ADCNT_ADCNT2_MASK                        equ 0004h
ADCNT_ADCNT3_POSN                        equ 0003h
ADCNT_ADCNT3_POSITION                    equ 0003h
ADCNT_ADCNT3_SIZE                        equ 0001h
ADCNT_ADCNT3_LENGTH                      equ 0001h
ADCNT_ADCNT3_MASK                        equ 0008h
ADCNT_ADCNT4_POSN                        equ 0004h
ADCNT_ADCNT4_POSITION                    equ 0004h
ADCNT_ADCNT4_SIZE                        equ 0001h
ADCNT_ADCNT4_LENGTH                      equ 0001h
ADCNT_ADCNT4_MASK                        equ 0010h
ADCNT_ADCNT5_POSN                        equ 0005h
ADCNT_ADCNT5_POSITION                    equ 0005h
ADCNT_ADCNT5_SIZE                        equ 0001h
ADCNT_ADCNT5_LENGTH                      equ 0001h
ADCNT_ADCNT5_MASK                        equ 0020h
ADCNT_ADCNT6_POSN                        equ 0006h
ADCNT_ADCNT6_POSITION                    equ 0006h
ADCNT_ADCNT6_SIZE                        equ 0001h
ADCNT_ADCNT6_LENGTH                      equ 0001h
ADCNT_ADCNT6_MASK                        equ 0040h
ADCNT_ADCNT7_POSN                        equ 0007h
ADCNT_ADCNT7_POSITION                    equ 0007h
ADCNT_ADCNT7_SIZE                        equ 0001h
ADCNT_ADCNT7_LENGTH                      equ 0001h
ADCNT_ADCNT7_MASK                        equ 0080h

// Register: ADSTPT
#define ADSTPT ADSTPT
ADSTPT                                   equ 0F63h

